[
{"ratings": "5.0", "reviewer_location": " CA", "review_time_utc": "1546318800.0", "review_description": "I love the service. A very tall male flight attendant took a lot of time teaching me how to use the computerized TV and making my seat more comfortable, all the while squatting down to my level to be heard. He also admired my hat when I boarded and politely ask if he could stow it up front so as not to get it crushed in flight. At end of flight he was waiting with a smile, hat in hand and gently placed it on my head. Also, their bathrooms are always very clean.", "num_found_useful": "7"}, {"ratings": "5.0", "reviewer_location": " MA", "review_time_utc": "1546318800.0", "review_description": "Have used JetBlue for last 17 years. Prices and rewards are good. Flights have had a great on time record and planes are comfortable and clean. Staff has been professional and helpful. Services including TV and snacks add to pleasant flights.", "num_found_useful": "5"}, {"ratings": "5.0", "reviewer_location": " Georgia", "review_time_utc": "1546318800.0", "review_description": "The skyscapes and ticket agents are very knowledgeable. The assistance to check keep the passenger alert, saving the anxiety of missing the flights. I enjoy the effort of the airline to store food on the plane to keep the children quiet and calm anytime on the airplane, to help for delays with landing.", "num_found_useful": "5"}, {"ratings": "4.0", "reviewer_location": " MD", "review_time_utc": "1546318800.0", "review_description": "Overall, this is my favorite airline. I prefer this line to others because it is usually clean, the flight attendants are helpful and courteous and flights are seldom booked complete. Our last trip involved severe weather in Boston, causing a 5 hour delay. While I was not happy about that, when it was time to board, my mom and I were boarded 1st since she was in a wheelchair.", "num_found_useful": "9"}, {"ratings": "5.0", "reviewer_location": " FL", "review_time_utc": "1546318800.0", "review_description": "Their in flight service, customer service and prices are second to none. Whenever I call with a problem they always find a way to help me. They have changed dates, seats and helped me get the best value. They are just awesome.", "num_found_useful": "5"}, {"ratings": "1.0", "reviewer_location": " MI", "review_time_utc": "1546318800.0", "review_description": "This JetBlue is the worst airline I have experienced. I had the flight with JetBlue on 16 August. When I reached Detroit, I didn't receive of one of my Suitcases (it had 23.5 kg weights). At the airport, I filled the form to track the status of my bag. From that time until now, every day I call them to ask the status of my bag. They hardly answered and always promised me to call back, but no one called me back. My stuff inside my suitcase was so important and necessary for me. Always I said them but they never paid attention. I really spent the hard situation during this time. I was a new student here, didn't know anyone, didn't have car, and I was not familiar with Detroit. I lost my stuff inside the bag and couldn't buy them. The weather suddenly became cold in Detroit and I didn't have warm cloths because they were inside my lost suitcase. I called them, talked about the situation, wanted them to find my bag or compensate their mistake. They really didn't pay attention. I lost my weight and became ill because of the cold weather. I was crying sometimes and really need their help, but they were really irresponsible people. After long time, they paid me only 650$ for delay and wanted me to fill the form related to stuff inside the bag with their price and details. I spent more than 10 hours to fill the form. The staff inside the form was really important and valuable for me. I really love them and I lost them. The expenses that I estimate in my form became more that 4000$. But, two days ago they sent me message that, \"We only want to pay you 250$ as compensation\". JetBlue is really bad airline. Not only they are not responsible for your suitcase and always you fear that they lost your stuff, but also if they lost your stuff, they never compensate it. Never try JetBlue.", "num_found_useful": "97"}, {"ratings": "2.0", "reviewer_location": " MA", "review_time_utc": "1546318800.0", "review_description": "Just called JetBlue to say a large group of us flying to the Dominican Republic from Boston this month are not happy that they changed our flight from a nonstop to a flight to a flight with a stop and layover, plus changing planes in Fort Lauderdale with no compensation. We booked the flight months ago and paid hefty prices before the flight prices plunged because of all the deaths in the DR. They told me they couldn't do anything about it when I asked for some kind of compensation for the inconvenience and cost. Every nonstop I've ever taken has cost substantially more. Just a heads up when using Jetblue.", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1546318800.0", "review_description": "At whatever cost necessary stay clear from Jet Blue, the customer service is not there. This airline company could care less about you making your flight. They are not there to assist you for checking in, or even getting your tickets. You will be harrassed and bullied by the Jet Blue staff if you happen to have a problem or complaint. There is no real format to training any of the staff at the front desk. The Jet Blue crew act in a manner of some type of mafia as if they're protected. You will not be treated with respect if you fly with Jet Blue.", "num_found_useful": "7"}, {"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1546318800.0", "review_description": "I purchased thru Orbitz for travel on Jetblue Airlines. Cancelled the reservation and rebooked. Emailed Orbitz x 2. Called as well last year Aug/Sept. Totally forgot about credit. Now want to book new trip. $435.98 lost I'm told because it has been over a year since original booking. Jetblue will not honor credit nor will Orbitz. Both, for the same reason ”its been over a year”. This in today's economic state not to honor one's credit and just take their hard earned money makes absolutely no sense to me. The amount that I lost is a brand new ticket. This will prevent me for future travel because of financial constraints.", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1546318800.0", "review_description": "This review base on customer service. On our flight from NY to San Diego the service was good but on our flight back the services were terrible. When we took off and everything was settle seatbelt sign is still on. I understand that but I have to go to restroom and I decided to be nice and throws out my own garbage. So when I went towards the back ask where the trash can is the guy \"William\" looks at me like I kill his family or something and took my coffee cup out of my hand and throws it out without saying a word and then make an announcement while I was standing next to him stating \"do not get up while seatbelt sign is still on.\" I'm like wtf really??? I'm going to restroom throws out my ** trash to be nice. And there's this lady. Idk her name but the way she talks is so sarcastic like wtf.", "num_found_useful": "3"},
{"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1546318800.0", "review_description": "Used information from over 13-20 years ago when as a single mother I had cancer (to deny me a JetBlue credit card...I've been a JetBlue customer for years) and at the time tried to consolidate my bills, but the judge wouldn't allow as I had no income and couldn't work at the hospital any longer due to my extreme cancer. They didn't even look at my current credit report. I have good credit!! What they said in the denial letter was completely inaccurate and offensive, how dare they!!! If I could give zero stars I would!! I'm informing JetBlue of this farce on Monday since today is Saturday. To humiliate someone based on out of date and inaccurate information should be a Federal offense, even a crime. Defamation of character!!!!", "num_found_useful": "2"}, {"ratings": "1.0", "reviewer_location": " AZ", "review_time_utc": "1546318800.0", "review_description": "My wife and I were taking a vacation to a Sandals resort in Jamaica. Flying Jet Blue for the first time and our Departing fight from Phoenix, AZ to Fort Lauderdale, FL was delayed 5 times with NO explanation. They offered water and chips for our inconvenience...what a joke. Ultimately the delays made us miss our connecting flight to Jamaica and this made us arrive in Jamaica 2 hours later, which took a full day away from our vacation. The return flights also had delays and our final flight back home from Fort Lauderdale was ultimately delayed an additional 3+ hours getting us back to Phoenix at 2AM instead of 10PM. ALL 4 flights with Jet Blue had several delays and never an explanation for why we had these delays.I wrote to Jet Blue and received what seemed like a form letter apologizing for our situation, but that was all. Several customers experiencing the same delays with us told me almost every flight they have taken with Jet Blue had delays AND no EXPLANATION. We will never fly Jet Blue AGAIN AND WILL OPENLY PAY MORE MONEY WITH OTHER AIRLINES TO ESCAPE THESE CONSTANT Delays!", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1546318800.0", "review_description": "I wished I could give them 0 stars! Horrible experience with this company, I totally understand there’s delays at times, but Jetblue is making delays on 99% of their flights! This is a joke to them, they delayed my flight three times before boarding from NYC to NC, waited three hours in the airport with my children, no explanations whatsoever, then they want to smack you in the face with chips and soda! Will never travel through JetBlue again. Same experience from from NC to NYC, delayed twice, then did not let me board the plane while door was still opened because they said they went back to original time, how’s this my issue???? Now stuck in NC with two children, did not offer any accommodations. Said they do not pay for any differences for another flight with different airline, do not provide hotel stay/travel/food vouchers. They only offer a flight the next day to Boston with a connecting flight that arrives 4 hours later, which I know, both flights will be delayed! Soooooo frustrated!!!", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1546318800.0", "review_description": "No matter what you pay, they will find a way to charge you more. I bought the fare with the max flexibility and 2 bags of 50 lbs each included. I took ONLY one bag of 75 lbs and was charged an extra $150 anyway, in spite of the fact that it is more economical space-wise for the airline to house my one bag at 75 lbs than if I'd taken the two bags at 100 lbs total. They also charged me the $89 for the extra room both with the ticket and then again the day before the flight. They backed off on that charge after I called them but refused to budge on the extra $150. Although I had paid for the flexibility, to change the flight one day would have cost me an extra $250. So, in all, paying extra upfront for the flex fare is worthless--they will still take you for all they can. These are dishonest policies and purposely misleading advertising. Date of travel: August 2019.", "num_found_useful": "5"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1546318800.0", "review_description": "Today, Aug 16, 2018, I booked a ticket and was unable to log into my TrueBlue account. I called JetBlue to correct any issues. I was told that the only alternative to receive my points (that I have earned from use of the credit card) and re-opening the account was if I provided an alternate email address. I advised that I do not have one that I can provide nor do I chose to use a different one. I was informed that if I do not do so that in the future JetBlue would not be liable if my points would be stolen or account breached. I asked to speak with a manager and was told the same by \"Kenny\" whom refused to see reason and insisted on the need for an alternate email. The accountability for a breach in the system by JetBlue was disgracefully handled considering an alternative email would be like asking me to give a different home address for mailing or obtain an additional phone number.", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1546318800.0", "review_description": "I was flying from Fort Lauderdale (FLL) to NYC (JFK) on July 31st, 2019. The flight was scheduled to leave at 8:36 PM and arrive at JFK at roughly 11:36 PM. It was supposed to be a simple flight that I had made many times before. The morning of the flight, I checked the flight status and it said it was delayed to depart FLL at 11:10 PM and arrive at JFK at 2:07 AM. This was a big problem because I had a connecting international flight from another airline that was scheduled to leave JFK on-time at 2:30 AM. I was shocked and Jetblue website did not explain why it was delayed. I figured I would go to the airport early so I could get on another flight to NYC. After I arrived and waited in line for customer service, I talked to a Jetblue representative about the situation.He said he could get me and my family on another flight leaving to JFK at 8:30 PM that was delayed from 2:00 PM that afternoon. He claimed there were seats on it. However, he began to go on his phone for 20 minutes. Then, he seemed to make a call but never actually said a word. This continued for nearly 50 minutes because he finally broke the news to us that this flight was completely sold out and the next available flight was next morning. I don’t know when this flight was sold out or if it was sold out when he told us there were seats on it. I don’t know what he was doing on his phone for over an hour but I was frustrated as I could’ve gone to another airline to buy another ticket.However, it was too late and all flights to JFK that would have allowed me to catch my connecting flight were gone because I had wasted my time with Jetblue customer service which ended up doing nothing for me. I asked the representative why flights were being delayed and he said there were thunderstorms in NYC. I checked the departure screens afterwards and it seemed that only Jetblue flights were delayed. No other airlines were delayed. I also called my family in NYC and they said there was no inclement weather the entire day. I started to question Jetblue’s honesty and transparency. With no other choice, I had to go along with my original flight and figure out the situation when I arrived to JFK.At around 11 PM, the gate agent for Jetblue announced that the flight was going to be delayed for 30 more minutes because of weather. After 20 more minutes, he announced that the flight was going to be delayed until 12 AM because there was no pilot for the plane. Everyone waiting was frustrated. Finally, at a little over midnight, we were allowed to board the plane. Before taxing out, the pilot actually walked out to the aisle and said to us that he didn’t even know he was supposed to be working and that he was at home watching TV when he got a call. Does Jetblue not organize or plan which flights have pilots? Or do they just get a random pilot last minute before the flight was going to leave? I was shocked at his announcement.When we finally go to JFK at 2:45 AM, my connecting flight had already left. I talked to the customer service of that airline and they said they were able to rebook me on a different flight that left that afternoon if I was able to obtain confirmation of the delayed flight from Jetblue so it was determined it was something out of my control. So I waited at the customer service for Jetblue at JFK for them to open and was able to talk to another representative. I explained the situation and she said that she was unable to give me any confirmation of any sort of how my flight to JFK from FLL was delayed. I explained to her that it was requested from a different airline and she outright said they were lying because that is a ridiculous thing to ask.I was lost at words because it seemed as if the staff only chooses what to believe if it was convenient for them. Moments later, an employee who I assumed was the supervisor came out and told me to vacate the premises because I was causing a disruption. I never raised my voice and was being polite the entire time! He claimed I was making things up and there was nothing else he could do for me. I had to go back to the other airline and tell them what had happened.Their customer service ended up calling the Jetblue customer service and regarding the delayed flight. However, they were able to sort it out and get me on the next flight out of JFK to my next destination. The amount of unprofessionalism, dishonesty, disregard for customers, and downright rudeness I have experienced from Jetblue in less than 12 hours was insane. There is absolutely no transparency or accountability towards customers from this organization. I will never be flying them again.", "num_found_useful": "7"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1546318800.0", "review_description": "My family and I had tickets for the 8:55 PM flight#36 from STI to JFK on August 08, 2019 which was canceled. I am writing to inform, as I am sure that many others have as well, that JetBlue handled this situation in an unprofessional manner. I enclose copies of the e-mails JetBlue sent changing the departure time for flight#36 from 6:54 PM to 12:42 AM.We accepted that our flight was delayed until 9:15 AM due to weather. We do not, however, accept that JetBlue did not immediately cancel the flight once it became aware of a weather failure. It is unacceptable that JetBlue didn’t prove us with hotels or at least blankets for the kids, a 7-year-old and a 5-year-old. The airport was not only dirty but the air conditioner was extremely cold, they had us stand around for 6 hours or more, only to inform us the flight crew was grounded because of the crew rest rule.Around 10:30 – 11:00 PM, my family and I checked the status of the flight#36; on the screen, it was delayed. I decided to go and speak with a supervisor or manager. I waited for 10- 15 minutes for the “manager” to come out to give me an updated of the flight. When I advised her of my situation she was extremely rude and didn’t have an accurate answer to give me. Not only did she give me her name incorrectly but her tone of voice and non-verbal communications were extremely unprofessional. I asked for her name, she told me it was “Ana **”. A couple of hours later, JetBlue employer called her for assistance and he asked for “Ana **”. At that moment I realized she gave me her name incorrectly. The “manager”, Ana ** was quick to help other clients with the same issues we were having. I was expecting better customer service but the time and unprofessional help were not up to my standards.However, JetBlue employees spoke rudely to all passengers waiting, refused to assist with hotels and re-booking and told us that we could not get on the flight the next day and maybe we would have to wait for all the way until Sunday, August 11, 2019. So, I asked another JetBlue employer if he would able to change the flight and he accommodate me. He then changed the flight#36 to flight#936 Saturday, August 10, 2019, at 2:57 AM. Not only did we have to go back to a hotel, paid with our money for transportation and food but the time and inconvenience with two young kids. We waited 1 hour for our luggage, extremely exhausted with back pains and headaches.", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " SC", "review_time_utc": "1546318800.0", "review_description": "My family and I had a ticket for the 9:28 pm flight from FLL to CHS on July 8 which was cancelled. I am writing to tell you, as I am sure that many others have as well, that JetBlue handled this situation in an unprofessional manner. My family and I had accepted that our flight was delayed until 1:15 am due to weather. We do not, however, accept that JetBlue did not immediately cancel the flight once it became aware of a mechanical failure. It is unacceptable that JetBlue moved our family to a different terminal at 2 am in the morning, had us stand around for one hour more, only to tell us the the flight crew was grounded because of the crew rest rule. JetBlue should have been aware of this rule and immediately booked hotels and next day flights for all passengers at that time.However, JetBlue instead spoke rudely to all passengers waiting, refused to assist with hotels and re-booking and told us that we could not get on the flight the next day and maybe we would have to wait all the way until Friday. At that point, I knew I just had to leave the airport- it was 3:30 am and my 9 year and 7 year old were of course exhausted. So, I asked Terry ** from JetBlue if I would be reimbursed for the cost of my hotel and re-booking on another airline since he was unable to re-book me on JetBlue for the next day and he said, \"Yes.\" I asked Terry ** this question 2 times to ensure that we were not misunderstanding each other and he said \"yes.\"Well, the next day I called the JetBlue customer service line while I was waiting in Miami for an American flight to CHS to find out how to be reimbursed the $1028 that it cost my family to buy 4 tickets to leave Charleston. This agent told me I would not be reimbursed and was very rude to me. She said I could have left the next day on JetBlue. When I repeated to your phone agent that the JetBlue FLL agent, told me he could not book me for the next day she just said, \"Well, I don't know why he said that,\" as if it was my fault that your agent gave me and everyone else on that flight incorrect info.By the way, there were other people on my American flight who had been booked on my JetBlue flight who bought their tickets for the same reason - the agent told them it would be impossible to book on JetBlue for the next day - which absolutely makes sense because you only have one direct flight out of FLL daily. I told her I would like to speak with her supervisor the next day, because at that moment my flight was taking off. She told me that this was impossible as they had no way to call customers. This response insults my intelligence.", "num_found_useful": "7"}, {"ratings": "1.0", "reviewer_location": " OH", "review_time_utc": "1546318800.0", "review_description": "On a recent flight scheduled to leave Ft Lauderdale, Florida at 9pm was delayed to depart at 12:40am headed to Cleveland and arriving at 3:45am. Its original arrival time was scheduled for midnight. The airline failed to contact customers until 6pm via email that their flight would be delayed. For some customers, that is quite late in the day and considering I was told by a Jetblue employee upon arrival to my gate, \"The airline started this flight off late from Puerto Rico early this morning. Then, continued to get later and later from there\". The airline had plenty of time to notify passengers of the near four hour delay, but instead decided to throw out a Hail Mary email including that passengers should still plan to arrive for the 9pm flight on time in the event something \"might\" possibly change. Weather was not a factor in this flight as it originated south of any major weather patterns. There is no excuse for the late notification.", "num_found_useful": "5"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1546318800.0", "review_description": "People be aware. JETBLUE WILL NOT BACK THEIR CUSTOMERS UP WHEN DEALING WITH ANY KIND OF MATTER REGARDING \"THEIR\" TRUE BLUE CREDIT CARD CHARGES! * First of all, I applied for their credit card but did not know it was issued by Barclays Bank! First time I used IT to purchase a ticket on Jetblue. I was duped to believe I was talking to Jetblue reservation center, but turns out I was speaking with a crooked online site using the name of Jetblue reservation center. They did processed the charges for the tickets I wanted and then some. The other charge I was not aware of. Once I found out, I called Jetblue to dispute it, and they said I had to call the Barclays Bank.** Only to hear that \"Madam, you did give them your credit card information\", yes I did because I was lead to believe I was speaking with Jetblue reservation center. To make a very long story short, I had to insist with her to at least try to get the unauthorized charge disputed. Well, I just got a letter saying they could not help me.** I am their client and they cannot help me? I am telling them it was a FRAUDULENT CHARGE and they CANNOT help me?? RUN THE OTHER WAY IF YOU ARE APPLYING FOR A CREDIT CARD AND THE ISSUER IS BARCLAYS BANK. They suck in customer service skills and fail to deliver the minimum! Anyways, I will pay the balance on my charge... the rest they will have to go after the merchant! *** Will never use them again and will review both (Barclays Bank and Jetblue Airlines) in every platform available!", "num_found_useful": "4"},

{"ratings": "1.0", "reviewer_location": " VT", "review_time_utc": "1546318800.0", "review_description": "My husband and I were booked on an 11:00 pm flight out of JFK. It was a short flight (approximately an hour) to Vermont. Weather delays in the tri state area threw things out of whack for everyone and we did our best to be patient as our flight got pushed back to an ETA of 2:30 a.m. At approximately 1:15 I got a chirpy text message saying our flight was canceled but we had options. By now the weather in both cities was perfectly clear so we don't know why the flight was canceled. They offloaded our luggage without telling us where so my husband had to go hunting for it. It took more than an hour. The one customer service person at the luggage carousel didn't seem to know anything. He finally found the luggage sitting in a corner.Meanwhile I got in line at customer service and while I was waiting I got an automated phone message saying we were booked on another flight at 11:00 p.m. the following day. What on earth did they expect us to do after they abandoned us in the middle of the night in one of the countries most expensive cities??!! While I was in line I looked for other flights in other cities and on other airlines but didn't have much luck. Meanwhile I got to talking to two other passengers from my flight who were also stranded. We decided to band together and rent a car and drive home.When I got to customer service it was another nightmare. No one knew what they were doing. Most of the reps stared at their screens as if they had never seen a computer before. The few people who did seem to know what they were doing were constantly leaving their customers to help their clueless coworkers. I asked the rep for a refund for the flight home and he agreed but said he couldn't provide me with any proof of it.We set out to find a rental car only to find out that none were available. It was now 3:00 a.m. and we met two other families from our flight, all of them stranded, exhausted and hungry with nowhere to go. One of our fellow passengers arranged for a car service to pick us up at an ungodly fee and drive us all the way home. By then we had all been up for more than 24 hours and even if we had found a car none of us were safe to drive. I contacted JetBlue about the situation as soon as I got home and two days later they gave me a $25 credit. So far I have seen no sign of the promised refund. So in addition to the trauma and aggravation we are out of pocket for our return trip home and the $500 it cost to get us home in a car. At no point in this process did JetBlue ever appear to care about any of us.", "num_found_useful": "9"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1546318800.0", "review_description": "Awfully bad experience. I travelled from FLL to SFO with my family. Jetblue prices grow much faster than other companies when you add just the basic option, in my case it was +50%, that puts this company to the same category with American Airlines, United, etc. For this price you have service, that is worse than the appropriate low-cost one. In FLL the terminal where Jetblue operates is far away from the rental cars parking, comparing to United, that operates in the same terminal. And even if Jetblue tails and admits it, you can't get anything - no business lounge, no paid hotels, absolutely nothing. I came to terminal and printed the boarding passes one hour prior to the takeoff. But the infrastructure in the airport, that works for Jetblue, is so awfully bad that I missed the flight.The system doesn't print tags for luggage and nobody assist passengers. Finally after few attempts we came to the service desk to print them, it was 50 minutes prior to takeoff. Then we spent over 20 minutes printing the tags, it's easy to see the timestamps on the tags. Finally they didn't give us all our tags, one was missing! People were extremely slow, there was a glitch in a software, then printer didn't work. Finally 25 minutes prior to takeoff we came to the security check, where we supposed to have a separate line. We didn't get it even after we told that we're missing the flight. The gate was closed strictly on time and we had to go to the Jetblue service desk.People at the desk saw right from the beginning all our statuses in the system and agreed that the was no our fault in this situation. They were not able to offer anything earlier than in 24 hours, but helped to identify all our luggage tags numbers and initiated the refund (appreciate it, however, I haven't got it so far). Everything else became our problem. We tried to discuss the situation with the manager on site, but this step was absolutely useless. We were waiting for him for 40 minutes, family of five people including five year old child, that already supposed to be sleeping on the plane. He told us that he's sorry about what happened but didn't offer anything to compensate our losses (time and money for the tickets that we had to buy in a last minute and hotel). He didn't say anything regarding the enormous timeslots for the typical operations, that we saw.His point was that even if passengers paid for some services to get faster to the gate, one hour is not enough and we had to come earlier. But passengers should be notified about this critical issues in advance and have clear recommendations. And it doesn't mean that airlines are free from any obligations to support passengers on site. Nobody notified me that I had to plan 30-35 for each operation. I would never go for it.Worst example of low-coster with the prices of the genuine airlines. P.S. My reservation: AGZWYA.", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1546318800.0", "review_description": "JetBlue used to be, by far, my favorite airline. They always had clean planes and superior customer service. In the last 6 months I have had a dramatically different experience. Of my last 7 flights, 6 have been delayed or cancelled causing significant frustration and missed time on vacation. This will be my last booking on JetBlue as it is now consistently ruining my family vacations.", "num_found_useful": "10"}, {"ratings": "1.0", "reviewer_location": " AL", "review_time_utc": "1546318800.0", "review_description": "​​Jetblue needs an urgent change - Holidays ruined by incompetence of Jetblue. Logistical failures that prevent schedules, lack of coordination between personnel lines at airports, lousy customer service, web page with slow and outdated information, even slower app and digital tickets do not work, and again customer service goes from bad to unacceptable level of business in USA. All this painful and unpleasant experience began when, on May 9 (1 month in advance), we decided to give Jetblue a chance and bought air tickets from my family (5 members) to travel from Atlanta to Quito on June 8, returning on the 26th. We live in Alabama, which involves a 2.5 hour trip to get to the ATL airport.On June 8, we arrived at the ATL airport and checked in at the self-service kiosk and were only provided with the tags for ATL-FLL, missing the FLL-UIO route. I decided to have the customer service staff. We are not given the tags explaining that the flight is delayed. Tickets printed and everything ready, unfortunately Jetblue decided not to take off until 3.5 hours later. After 3 hours of waiting we contacted the counter and they informed us that we would reschedule the tickets for 11, because the flight would not arrive in time for the FLL - UIO connection. It did not matter that family meetings planned months before had to cancel. Jetblue argued that they could not do more and that they did not have flights available to accommodate us before that date.THREE DAYS LATER, we returned to the ATL airport and this time we got the tickets and complete tags, checked and delivered 2 pieces of luggage. While we were passing TSA and approaching the boarding gate, Jetblue decided to prioritize waiting passengers and had our 5 seats and a sixth passenger to UIO, leaving us again off the flight, suggesting again reschedule our tickets for 13. An agent named Michael approached to explain that Jetblue could dispose of the seats at his discretion. As a special concession, we would keep our checked baggage, already on the plane, and deliver it to UIO, when our itinerary would finally be fulfilled. Recommends that we call Jetblue by phone if we want to extend our stay. When calling, an agent tells us that it will cost US $250 each to modify the return date by Jetblue policies.After FIVE DAYS LOST FAMILY HOLIDAYS, we returned to the airport and made the process again. Being in line to check, the airport manager for Jetblue informed us that with the electronic tickets we could advance to the boarding gate. Upon arrival with TSA, they indicated that the electronic tickets were not valid to fly that day, which appeared as usable the previous day. We return with the Jetblue agents and ask them to review, they tell us that the flight was assigned for the 12th, due to confusion, and they assigned it for the 13th at that moment.With the printed tickets we go to the boarding gate, where we are witnesses that the staff asks for volunteers to travel later because this time they also have overbooked tickets. We fly to FLL. Upon arrival we approach the customer service desk at terminal E to find out about our bags, there are 3 employees of Jetblue talking about who will take the turn of Friday night, because they would like to attend a party, while 8 clients wait. 2 of them are: Justin and Janelle **. When I ask him to do his job and I want to know where my bags are, he tells me that I have to go to the warehouse and find it to take to baggage delivery, because it is my responsibility to have lost the flights. When explaining the responsibility of Jetblue in all the delays, he agrees to call, he tells me that unfortunately there is no one who attends the warehouse and that he will continue to insist, and recommended to advance to the exit door to UIO, because Jetblue could take the decision to take off without us. I take the advice and go to building F. There, I go back to the customer service desk and request my luggage information again, the agent surnamed ** tells me to look for it, 20 minutes later, she confirms that my luggage is located and will be sent on the flight we are traveling.When arriving in Quito, the luggage did not arrive. A Jetblue agent approached us and offered his help, explaining the situation, he started looking for luggage at ATL, FLL, UIO until he finally informed us that he was on the next flight and that he would help us recover it.​ When arriving in Quito, the luggage did not arrive. A Jetblue agent approached us and offered his help, explaining the situation, he started looking for luggage at ATL, FLL, UIO until he finally informed us that he was on the next flight and that he would help us recover it. 1 hour after waiting for an answer, but with someone looking for it, we receive news. Thanks to this employee, a mole in Jetblue, at least we received our luggage, late but we got it. Great work by Carlos **.As a result, our planned vacation for months, including family and religious ceremonies, was ruined by the dismal performance of Jetblue employees, FIVE lost days, waste of time, fuel (2.5 hours of travel between Chelsea AL and Atlanta GA and vice versa, 4 trips with a total of 10 hours), and emotional wear and tear are the result of our first flight with Jetblue. I need to know what actions the company intends to take in the face of this poor performance and what remedial actions it will have for us. I am awaiting your response and I am ready to provide any additional information you may require. I reserve my right to make my claim public.​", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1546318800.0", "review_description": "We arrived promptly at Logan airport in Boston Mass, hours before, for our trip to Punta Cana DR. This was our first vacation for my fiance and I with our two children age 21 and 14. We had 14 other family members going with us also. Had our flights checked in online the day before. We arrived with our AWAY luggage and had it checked in with no problems. We then all went through security with no problems, and went to sit at the area where our gate was. 30 minutes prior to the doors closing they called our names stating there was a problem with our luggage. They had the batteries in the baggage in which we were not aware it could not be there. We purchased the away luggage because one of the biggest selling points were the chargeable batteries. This being our first flight we did not know they could not be installed in the bags where they belong. Later on one of the workers there told me they wish they would stop selling the AWAY bags as this has become a problem. Knowing that they should put up some type of signage stating if you have luggage equipped with batteries, they must be removed. They told us to hurry and sent us to a location where they stated our luggage would be there to pop out the batteries and make it back before they take off. They sent us to the wrong location stating our luggage would be there. That department sent us to the right location and our luggage was not there to remove the batteries. We waited so long for them to get the bags, moved so slow they could care less that this trip cost us $9,000 total including straight flight from Boston to Punta Cana and back, all inclusive resort for 7 days and a van to and from the resort. Finally they retrieved our bags. We took the batteries out. They had us place our 4 bags again at the baggage area and go to security. If they would have put us through the security quicker stating we had already been there we would have made the flight. Instead they stated we had to wait in line. I received a call from the flight attendant stating they were closing the doors and we would not make the flight and if I would give permission for my 14 year old child to travel with our older family members putting them in charge of her as she was a minor. I consented as they were on the plane already and thankfully I had my family members there I trust with all my heart. They made us miss our flight, separated us from our kids who were now on the flight with our family. I paid extra money for a straight flight. They took us out of the security line went to retrieve our bags again so they would not be on that plane and had us rebook two tickets, one for me and my fiance. The only ones they had available were to leave at 1:30 to JFK and then after 1.5 hours to Punta Cana. We retrieved the tickets again. Checked in our bags and went through security. The flight attendants were very nice and explained everything on the plane where things were if needed. Instead of arriving at 12 noon in Punta Cana We arrived at 6PM after customs and everything we had to go through and the drive we arrived at 8:30 PM that night. My daughters were so happy to see us and I later found out the youngest one had cried. She was afraid something would happen to us. There was no urgency on their part of taking care of passengers who paid so much money for a flight, no care or compassion for what occurred. Not even an apology. I will be posting this on multiple other sites as I do not want this happening to anyone else and feel this is unfair. We all work hard for our money in order to be able to take a vacation. I missed a whole day of mine because they couldn't just take an extra step to help us. I'm very disappointed in Jetblue. We will be taking many more vacations but I do not believe Jetblue will be getting our money anymore and from what I read on the other comments it looks that way for other people also. Thank you to anyone who has read this and understands my situation.", "num_found_useful": "10"}, {"ratings": "1.0", "reviewer_location": " GA", "review_time_utc": "1546318800.0", "review_description": "My daughter/son in law and kids were to fly from SeaTac to Alaska (they live in Georgia) for a short visit only 4 days so there was hotel car rental and a cruise planned. But after a 5 hour delay for no reason they canceled the flight and would not be able to get them there till after they were to leave. I have never heard anything good about them and this just proves my point. Stay away from them, their cheap prices are not worth it. There are other cheap ones out there.", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " NC", "review_time_utc": "1546318800.0", "review_description": "On 6/24/19 my mother-in law was flying on Jetblue flight number 1646 from Charlotte to Boston when some lunatic who was sitting on seat number ** decided to start punching and kicking her chairs because she was reclining. We tried calling the customer service number to get some type of direction on how to file a complaint as she is scared and crying due to his reaction. The customer service name rep Jenny as well as her supervisor named Morgan explained there is nothing they can do and said “what would you like Jetblue to do?” My answer is simple “be more considerate.\" How would you react if that was your mom and there is some random person reacting this way? Are you all so clueless to know that people’s mentally are off and that proper precaution should always be taken. If the flight is still on the ground why wasn’t he removed? Was it because her limited English? What will Jetblue do if something were to occur while In the air?", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " GA", "review_time_utc": "1546318800.0", "review_description": "I would advise anyone who buys packaged flights not to do so. You'd pay slightly less money but the act of flying on JetBlue, making it to your destination, and connecting on another flight is practically impossible. I bought a flight that was supposed to be connected at JFK. JetBlue delayed my flight by more than 3 hrs. I ended up getting to JFK by midnight and of course missing my international connection. JetBlue gave me, us, nothing: no hotel, no refunds, no allowances to accommodate changes to the international flight, not even a meal ticket. Now I will, for sure, not buy a JetBlue ticket ever. So be warned! Pay a little extra and don't buy your ticket online. Or see if any of your flights are on JetBlue and avoid them.", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1546318800.0", "review_description": "This review is on the booking process rather than the actual flight. I have always loved JetBlue but today my opinion changed. In February I booked a flight for my sister-in-law to fly from ATL to JFK and returning to ATL in June. Today I went onto the JetBlue website to try to get a better seat and make final touch up since she needs wheelchair assist etc. On seat selection I was offered a wonderful seat in first row (1A with plenty leg room) so I paid extra $42 from the ATL-JFK leg and $50 for the JFK-ATL leg). I was not able to ask for special accommodations and I noticed that luggage was not included (what!!). But I have no way to pay for luggage.So I opened up a chat window and a lady name Ashley came on to help. She said I can add luggage and pay the fee on check in. I explained this is an 82 year old traveler and I want to make sure she is all set but with all the technology, JetBlue was not able to help me pay for this old lady luggage. I fail to understand from a programming point of view if I can pay for a better seat and the system can take credit cards, why can't I pay for luggage. Very disappointed, won't fly JetBlue again.", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " NC", "review_time_utc": "1546318800.0", "review_description": "I wanted to cut my trip to Puerto Rico short because I found out (while on my trip) that my grandmother has uterine cancer and needs emergency surgery. Myself and my family members are her primary caregivers, so it’s very important that we’re by her side for this procedure. I wanted to change my flight to come home a day early and was told I’d have to pay $600 to do so. JetBlue offers fee waivers IF you can provide documentation of the emergency and if it’s approved. Mind you, I’m still in Puerto Rico and my grandmother is in North Carolina. A lot of phone tag would be required to get a note from her doctor. Her doctor is also on vacation right now, so I wouldn’t be able to get that documentation for who knows when. In order to get home, I have to fly to Orlando and then turn around and drive 9 hours to North Carolina in order to be with her. I chose to fly from Orlando because it’s cheaper. I’m not a millionaire and can’t afford to pay $600 to change my flight. I refuse to get a doctor's note because I shouldn’t have to prove my grandmother has cancer in order for JetBlue to waive the fees. It’s ridiculous and I will never be flying JetBlue again. They aren’t helpful or understanding at all in cases of emergencies. I’m disgusted.", "num_found_useful": "5"},
{"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "4 member of my family is travel from New York JFK to Puerto Plata fight 627 on 7/26/16. We were there 5 am flight is 7:41 am. We all on the line waiting for check our bag. When we finally get to the desk, they checking 3 of us and left one out saying that we were late. \"But how come u checked 3 ppl and left one of kids out? Isn't that crazy? My poor nephew couldn't go in the plane. I was fighting with them to get another flight, then they said no more flight to Pto Pta. Have to wait for the next day. I called JetBlue spoke with a supervisor. He got one flight to Santiago, Dom Rep. 9 pm which is 2 hour different for where we supposed to go. And on top they charged $50.00 US like it was my nephew mistake. Nobody help us to find an early flight left the kid for 14 hour at the airport for the next flight. I hate JetBlue and none of my family will travel again with JetBlue. It's suck. Customer service so rude, unprofessional. They just care about money.", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1451624400.0", "review_description": "So after changing the gate number twice and having some slow downs in security I got to the boarding gate at 7:05 instead of 7:04. I understand that I was late by a whole minute. But it is the way the lady at the gate handled it. After I rushed up to her with labored breath she says \"Where you goin'?\" \"New York.\" \"No you not. The gate closed.\" No sympathy, she then told me to just sit down and someone will be with me. She of course was speaking over my questions of \"but it's just one minute. The plane is there can't I...? But the gate number changed... But I'm right here.\" Again, I get that I was late but it could have been handled differently. This is a \"reputable, respectable\" airline. I then walked away to hear over her walkie talkie that the door had just been closed. Just now, as I was walking away. I had to watch the plane, a few feet away from me, unmount and leave in about 15 minutes.This experience would have left less of a bitter taste in my mouth if the lady had at least pretended to care instead of being so unprofessional and uncouth. Customer service is what keeps customers loyal in this fast paced modernized business environment. Next time I'll just fly with the ever friendly Southwest Airlines.", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1451624400.0", "review_description": "A family of 18 traveled to Saint Thomas and tried to get home to Boston. We go up to the front desk to check luggage after 12 days away. They said no we cannot check any luggage. So we had to ship everything back. There was no email or heads up explaining this. They said the luggage will weigh down the plane. Then we start to board the plane... It was one of those planes you walk out to for a short 30 min flight to Puerto Rico for our layover. They said \"leave the bags here and we will put them in the back.\" We landed and waiting outside the plane for our luggage. They opened the back and there was no luggage. Only red crates. The company got a good deal from someone to ship all of their supplies and not take any luggage so the plane took off without our luggage. These bags are checked bags. They only have names on them. We had to fill out forms describing the bags. A week later and they still can't find 11 bags. These bags have thousands of dollars worth of clothes on them. Me and 18 other people are furious and will never support or give good feedback on Jetblue ever again. It is unbelievable that the plane lost the luggage and cannot find it. They knew this was going to happen and lied to all of the customers about it.", "num_found_useful": "7"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1451624400.0", "review_description": "My 2 minors grandkids were traveling for the first time on a airplane and they were kinda nervous. I had to keep them calm and I told them they will be ok. I trusted Jetblue, but there were some issues on the arriving here in orlando from la guardia new york. They were to depart on 2:55 pm and arrive to orlando at 5:46 and they were on the plane on and off. They say it was due to weather conditions and needed to refuel. So many story but they end up arriving to orlando florida at 10pm.My kids were so nervous, and had a bad upset stomach ache when I picked them up. They told me never again they want to be in a plane. I am so upset because they had to go through this while I told them that I trusted jetblue. This was on 07/08/2016 friday flight 1199. I am so, so upset because till now they kinda nervous and throwing up because of this bad experience. Never I will trust my grandkids travel on their own because none of the staff on the plane comfort them.", "num_found_useful": "7"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "I had no medication and I let them know that I was bipolar. Instead of having any kind of sensitivity to my disability and having someone talk to me. I was thrown out of the plane like a bag of daily trash. They rushed me out of their terminal. I could not believe their treatment. I was taken to the desk where I was given a ticket for the next day. I had no place to go. No money worth mentioning in order to take any kind of taxi. None of the Jetblue people would talk to me. Really not making my experience any better. My tears were ready to come out, but I had to keep it together.I finally decided to walk out with my luggage. My new reservations were for 5:10 a.m. the following day. I was really feeling very bad about my life. Not being able to speak to anyone. As I walked further there was this lady washing her car. I asked about a hotel. She gave directions. I could not understand her. Not much I could make heads or tails with at this minute. This woman put me in her car and drove me the hotel. I could have kissed her. I didn't because I'm a guy. She was like a Guardian Angel.I didn't really sleep that night. My nerves were ragged and self-destructive thoughts were running through my mind. No one would listen to me. Nothing I could say. At 4 a.m. I left the hotel. Thank god that they had like a trolley that took you to the airport. After getting to the airport I go register at the machine. It is then that I realized that I have been put on standby. If the plane was full no way I am going to get home. I am ready to cry again. I have no medication and this was enough for a major breakdown. I went to the desk and politely asked for a seat number. They told me that they call me. I couldn't afford to stay here again. Since I had to fly back standby JETBLUE owes me for my return trip airfare plus reimbursement of my one night's stay. After all the E-mails back and forth they have agreed to reimburse me for my hotel. I am still fighting for my flight reimbursement. Have not mentioned my mental pain and anguish.Can anyone help me? I feel that they need to educate their crew members on their sensitivity toward bipolar disorders. They refuse to acknowledge the fact that I was ill treated. No one cared about my well being. I hate to play the little guy game, but the airline has to understand that we have rights. How many people have they treated like this that had no courage to complain? I will complain to whoever  will listen. I am still very hurt inside. O.K. that hurt has turned to a lot of anger. I am so frustrated. Original flight number 938 From Aguadilla, Puerto Rico seat #25F (bumped off) 6/28/2016. New flight 838 on 6/29/2016 which was stand by. Which I would like to get reimbursed for.", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "DO NOT book a package deal on JetBlue.com!!! I booked a vacation package deal to the Bahamas on JetBlue.com. Upon arriving at the British Colonial Hilton hotel, I was redirected to a nearby hotel because the hotel had no air conditioner for the past TWO WEEKS! JetBlue did not informed me in advance to traveling. According to them, they were not informed by the Hilton hotel. Now they are informed bc I let them know, however, the same deal is still on their website!!! In any case, as long as they make money out of it, they don't care if their customers are sleeping on the floor or out on the street. I will only be refunded 1/3 ($516) of the total package price ($1,600) bc apparently that's what Hilton refunded them. I spent $1,300 at the new resort that Hilton directed me. Bottom line, they are the worst! I had to call them for a refund! And their customer rep told me to write an email to \"dearjetblue@jetblue.com\". Why am I calling AND have to write an email to get my money back for their TERRIBLE service? They are a joke!", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " NC", "review_time_utc": "1451624400.0", "review_description": "My family was traveling from Raleigh to Trivandrum - First day they have delayed flight and they didn't do any alternate approach to catch our connection flight and the supervisor was rude answering questions. They rebooked and didn't provide any reference number or print out - They get our baggage from flight, two of the baggage fully damaged, lost wheels, tear everywhere. I bought two new baggage for continue my travel. Next day we came back again from Winston Salem, they told us everything is confirmed they on-boarded in the flight - WE have five people, one old woman, one pregnant women, my wife and two kids. We got ticket only from Raleigh to Boston. Whey told us that everything is confirmed \"you will get the connection flight tickets from Boston.\"Once the flight took off we asked again - they confirmed and tell us with the data that your bag is through Raleigh to Trivandrum. That itself says your ticket is confirmed - you really don't want any confusion. I was quiet, relaxed and left airport. While driving back to home, family reached Boston at 8.30 and my wife told me that emirates don't have reservation or confirmation from JETBLUE on their tickets. Went to jetblue counter shuttled between emirate and JETBLUE counter-without no results- My family members were crying from the airport. JETBLUE told to them around 10:00 pm \"emirate is cooperating with us (what is that).\" Also \"gate is going to close you cannot travel today.\"All of them were mentally disturbed, had no clue what is going to happened. JETBLUE WASH THEIR HANDS AND CLOSED THE COUNTER - Don't give permission to continue their business. They are going to make money by cheating travelers and giving very bad experience. My family were on depressed - I really don't want to happen again with any another person. Give us right justice. This is a clear case for cheating. I need at least one million dollars for compensation.", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1451624400.0", "review_description": "On Sunday June 5th I was a standby passenger along with 7 of my friends. We boarded and sat in our seats ready to taxi when a JetBlue employee by the name of Erica, came to the back of the plane and told me there was a broken chair and to come with her to the front of the plane where she had a seat for me. My friends and even a flight attendant heard her tell me she had another seat up for me. When I got to the front of the plane I saw no empty seat and the woman told me that I needed to talk to the gate attendant real quick. I had no idea what was going on and neither did any of my friends. I told her I was not getting off the plane without an explanation and all she said is that I had to talk to the man at the gate. I complied and stepped off the plane only to hear Erika say \"Close the door\" to the flight attendants. When I got back out to the gate I flipped out as they closed the plane door and told me since I was on standby and another passenger who had previously purchased that flight had a broken chair and would be taking my seat. I was not allowed to go back on the plane to tell my friends what was going on as the door was closed and the plane was taxiing. My friends were not told what was going on. They thought I was on the plane. What if I had medication with one of them or a medical emergency? I wasn't given any explanation and neither were my friends. The way this was handled was completely unacceptable. Of course the next flight out until 6 hours later but I was not confirmed on the connection so the only other option was to be put up on a hotel or take a two-hour cab ride to Jacksonville to grab a flight back home. I can't believe how I was treated on this flight by JetBlue considering excellent customer service is your main priority. Shame on you JetBlue!", "num_found_useful": "9"}, {"ratings": "1.0", "reviewer_location": " MI", "review_time_utc": "1451624400.0", "review_description": "Ms. Geraghty: \"The mission was to bring humanity back to air travel\". This is your statement which was commendable and a welcoming statement in an industry that is demanding and stressed with FAA regulations, TSA regulations and the consumers. Air travel should be a comfortable and joyful experience. On May 29, 2016, I boarded Flight 1589 at Gate D15, assigned Seat 7C. Upon boarding I walked to my assigned seat and found an older couple who were above average in weight. I am 6'1\" and weigh 260 pounds. I am not obese, I'm a large-framed man who is very athletic. I was involved with the NFL in the early 70's.Flight 1589 was possibly at 50% capacity. Rather than inconvenience the older couple, I stated to the couple to stay put and I will sit two (2) rows back in empty seats. At that moment the flight attendant (Kathy) who must have had a very bad morning was extremely obnoxious and somewhat upset at someone from the onset. As we boarded the aircraft at 7:00 a.m., she was not barely and able to place a smile on her face to greet the passengers as we boarded. Kathy stated the seat I was sitting in required an upgrade. I did not want to pay the upgrade. Kathy offered me to sit in the back of the aircraft or take my assigned seat. The back rows were empty.The confusion?? A flight attendant began giving me instructions. Not understanding what she wanted, I merely took my assigned seat (7C), and apologizing to the flight attendants and to the couple who was sitting in row 7. Shortly thereafter a supervisor, Chantel arrived and asked to talk with me in the Jetway. She instructed me that I am a security safety risk to the aircraft. During our conversation with the supervisor, Kathy placed my carry-on luggage in the Jetway. Totally confused, I asked what is the issue. Again Chantel stated I was a risk to this aircraft and other passengers.Totally confused without discussion, Chantel stated we are placing you on the next flight to Boston and then to Fort Lauderdale. I tried to explain to Chantel and the flight attendants I have an engagement to attend at 5:00 P.M. that day, to arrive to Fort Lauderdale at 4:00 P.M. would be tiring and not amenable to my schedule. Again the Flight Attendants stated \"you did not follow our instructions\". Obviously with no other options, without further discussion or understanding, I was forced to take the connecting flight from Boston to Fort Lauderdale. Be mindful I was told I am a security risk, yet I was placed on the next JetBlue flight to Boston then to Fort Lauderdale. I was not able to attend my niece's engagement.Conclusion: the flight attendants should have a procedure to follow before removing a passenger or passengers from a flight. Alcoholics who are disruptive is a zero tolerance. Drug addicted passengers who are disruptive is a zero tolerance. Thereafter for customer relationships and customer satisfaction, without compromising other passengers and delay to push the aircraft from the gate, the attendants must be able to communicate with passengers and bring forward a peaceful resolution before removing passengers from an aircraft.I know all to well flight procedures. In this instance I was confronted with two (2) flight attendants who were not happy to be on this flight nor did they appreciate they have a job nor do they appreciate the importance that JetBlue have a friendly customer relationship base. I am 69 years old, in excellent health. I am a true-blue customer who often flies to Fort Lauderdale for business. I am a pilot with over 2700 hours of flight time. See attached. I have never experienced such demeanor and humiliation by flight attendants. I have volunteered and taken children for short airplane rides to promote \"flight\". The airlines should always be a fun-filled experience.Based on recent news coverage which I have recently discovered of passengers being removed from JetBlue flights, it is appalling that flight attendants are not given instructions to utilize their discretion when dealing with very minor issues such as a simple seat assignment on an aircraft that is at 50% capacity. I opted to pay the high price $436.20 for travel to Fort Lauderdale on JetBlue, versus Spirit Airlines who charged $227.00 for the round trip ticket. I would like to seek compensation for a connecting flight and a discussion with the two (2) flight attendants via e-mail or via telephone. After 69 years \"The mission to bring humanity back to air travel does not exist in the air but in life\". Thank you.", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " ME", "review_time_utc": "1451624400.0", "review_description": "Beware when booking a vacation package with Jetblue Getaway. When booking my vacation with Jetblue Getaway Packages, I was told by the customer service agent my hotel would have a kitchenette and complementary breakfast (breakfast included) each morning with my package. I specifically needed a kitchen when I travel, because I travel alone, and prefer to cook in my hotel, also traveling on a budget. I believed them. Upon arrival checking in (a Marriott Renaissance) they told me no breakfast included, no kitchen in the room. I was forced to pay $25/breakfast and $35/dinner minimum at this hotel, or starve. I went to the grocery store and tried to make meals with a microwave only! Terrible experience, when calling Jetblue during my stay to let them know, rep told me to \"be nice\" and go to the front desk and maybe they will upgrade me. They didn't. My vacation and $2000 down the drain. I tried to make the best of this situation, but will never use Jetblue again.", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " NJ", "review_time_utc": "1451624400.0", "review_description": "I called Jetblue because I enrolled in this True blue program they announce and to gain points I traveled with them since January 2015 (round trip). I had another flight on September 2015 (round trip). When I was going to buy another ticket in May 2016 I had 0 points. Like if I never had any trips. Before this in January 2015 I realized that my points were not added to my ticket fare. I called them and the operator said that the tickets will be added once I travel there. I traveled then in September always putting my email address when I was asked for my Trueblue email address. Once I entered it the True blue number assigned since the very beginning appeared in my reservation: ** (as always it says Trueblue member **).Now that I called to ask why I do not receive any points yet, they told me that the number does not exist anymore and that is under another person's name. I told them that I don't assign the number I put my email and the number is always assigned by their system. Their answer was to create another account to transfer my points worth only from 12 months ago (meaning I lost the points of my first purchase January 2015). I said is not fair because they STATE in their page that the points do not expire and I should have points from the very first trip to the last one. It is not my fault that their system gave me a wrong number. After trying to reason with operators and Managers whom I called 3 times, I tried to create another account so that I assigned the 12 month points and it marked an error. I could not use my email to create another account to transfer my points. I lately tried to create a new email and to claim at least the points I should have since September 2015, and still have error messages. In the error message always appears the number I called already many times to solve this problem but they do not help at all. I have not receive any emails from them, neither an update information on this case. They just limited to say that they will look for the problem and that it could take months to solve it. Therefore, this True blue points is FALSE is just propaganda they are using to have people buy their tickets and they just don't care to solve any problems presented to them. They blame \"the system\" and let me tell you a company that do not control their system is not a good neither a trust company at all.", "num_found_useful": "7"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1451624400.0", "review_description": "MY flight was fine except for the surprise luggage fee. But now that I'm home, I've found IN-FLIGHT CHARGES on my credit card. ON A DAY I DID NOT FLY! I was with a handicapped & legally blind man, we brought our own sandwiches & water with us. He's BLIND so he slept & I read my Kindle. Very thankful that the person in front of me was kind in their seat position. I spoke with Laurie at JETBLUE as soon as I saw the charge for??? in-flight charges??? Nobody knows what? I explained that we received no drinks, headphones, etc & STILL the charges are not removed.I feel JetBlue scammed me as far as luggage goes & now SOMEONE AT JETBLUE IS MAKING CHARGES TO MY CARD. Did I mention charges on a day I did not fly? I am livid that my card # has been misused but also that customer service Laurie & supervisor Rosemarie have the \"too bad too sad\" attitude. I now have to cancel my card and dispute the IN-FLIGHT charges for the day I did NOT FLY. JETBLUE HAS A THIEF ON BOARD...", "num_found_useful": "13"}, {"ratings": "1.0", "reviewer_location": " CO", "review_time_utc": "1451624400.0", "review_description": "Our flight got cancelled due to a blizzard in Denver so no fault on the part of Jetblue. It's what happened after the flight was cancelled that became a nightmare. We arrived at JFK after learning the flight was cancelled after we were already in route to the airport. This was Wed the 23rd of March. Upon going to the help desk we were told the soonest flight was Saturday the 26th, I said immediately said that Saturday wasn't going to work so could we get on a standby list or fly back with a layover instead of direct. The rude agent said \"nope it was Saturday or nothing\". I waited a bit and called Jet Blue customer service because I had never heard of a major airline not having standby, the agent on the phone said \"yes of course there was standby\" but she couldn't issue the standby tickets so back to help desk at the airport.Back to the help desk we went, this agent was rude as well and said she would issue the standby tickets but their policy was not to do it and \"just put you on the next flight available\". We explained that we would just spend the night in the airport in hopes an indirect flight would open up, I asked if there were cots/blankets available. The response was \"well I have no idea where they are so I just suggest you look around the terminal and see if you can find something yourself.\" Meanwhile in Denver the airport handed out cot/blankets, meal tickets, to those stranded in the airport overnight. While we were at JFK the agents were not only rude to us but I witnessed them be rude and yell at several passengers while in line at the help desk. We didn't get a food voucher or for our 30 hour stay in the airport, while the blizzard was certainly not the fault of the airline.I can't believe the difference in treatment of passengers in Denver and JFK. I have only written a fraction of the issues with Jetblue on here and will never fly them again. We did get on standby the 24th and thankfully got off that horrible terminal. It shouldn't take so many calls and arguing with customer service to get on a standby list and get out of an airport. Never again Jetblue.", "num_found_useful": "9"}, {"ratings": "5.0", "reviewer_location": " OH", "review_time_utc": "1451624400.0", "review_description": "My husband and would like to thank Jetblue for their outstanding assistance in getting home to a son that was hospitalized, in a life and death circumstance. They were awesome about helping us get from the Bahamas to Cleveland the next morning with a small cost, waived all the fees to change the two flights. Can't thank them enough! In general, we were very impressed with their free snacks and beverages and we paid no carry-on fees. They will be our first choice in the future.", "num_found_useful": "2"}, {"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1451624400.0", "review_description": "This was absolutely my last flight on JetBlue. A free ticket couldn't get me back on one of their miserably uncomfortable planes and that's after paying more for extra leg room which, at 5'2\" I didn't need. Broken seat back forced my neck forward for six hours; stewardess seemed amused at my discomfort! Hard as a rock seat cushion kept causing my legs to fall asleep. Two-hour delay taking off because this airline still doesn't know how to allot for luggage weight! The flight sucked as much as the airline. GO OUT OF YOUR WAY TO NEVER FLY JETBLUE!!!", "num_found_useful": "12"}, {"ratings": "1.0", "reviewer_location": " NH", "review_time_utc": "1451624400.0", "review_description": "These two airlines are charging twice as much as the major carriers to the Caribbean? For what they are charging, I could fly to Europe and back. $700-800 round trip! Or more. This is on the low side. :(", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " PA", "review_time_utc": "1451624400.0", "review_description": "I booked my daughter a flight from Florida to Baltimore on Jetblue thinking that it would be a reputable airlines. Boy was I wrong... They were the worst airlines that we have ever encountered. I really don't understand why they are still in business. They are the only airlines that I know that charges extra fee for carry on luggage, their stewardess are the rudest people that I have ever met. If you want a drink or a snack then have a cc ready to pay for everything on this flight, hell you might have to pay to use the restroom. My daughter missed her flight due to the incompetence of the customer service associates at the check in desk and then I had to pay again for another flight while she sat in the airport for 9 hours to the next flight and did they offer a discount or comp anything for us, hell no they did not!!! I would never recommend this airlines to my worst enemies as no one deserves the horrible rude treatment of this airlines... PLEASE DO NOT EVER BOOK JETBLUE!!!", "num_found_useful": "12"}, {"ratings": "5.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "They could extend their price match guarantee to more than 24 hours and book flights over the phone without the 25 dollar fee. I have no complaint the few times that I have traveled with them. They have been excellent. They have free snacks, televisions and the cheapest prices.", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1451624400.0", "review_description": "JetBlue buries in very small, hard to read print that if you cancel a non-refundable flight, in addition to paying a penalty, you will only be issued credit in a JetBlue account. What they don't make clear at all is that if you don't use that credit in a year, it will disappear. They will just take your money. Beware of purchasing non-refundable tickets on JetBlue.", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " NJ", "review_time_utc": "1451624400.0", "review_description": "Booked a flight with a hotel package in Puerto Rico. Arrived at the hotel and found out the room was canceled without our permission. Had to wait hours on the phone to get another room again (practically homeless for 3-4 hours), only to find out that Jetblue accidentally made the mistake on their end, and did not plan on informing us. Never doing business with them again. The reps hung up on me 4 times, and on my husband 3 times as well. It was so bad that we both called at the same time to ensure we could be helped out!!! I have used other airlines and never had an experience like this. I recommend United Airlines!! :)", "num_found_useful": "10"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "I had a flight on 3/4/16 from Orlando to New York, LaGuardia. The flight was delayed from 7:14pm to 9:00pm. I asked to be put on the flight to JFK from Orlando at 6:52pm. I requested this at 5:40pm, an hour and 12 minutes until the flight. They said they wouldn't be able to get my bag on the flight because they need an hour and 15 minutes to do that. Literally 3 minutes. The supervisor was so unprofessional and rude with his comments. This was the first and will be the last time I fly JetBlue.", "num_found_useful": "10"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "I am currently sitting on a Jetblue flight at LaGuardia Airport that has been delayed for two hours. We had to be deiced twice and the was some engine failure that required us to go back to the gate. The entire time we have heard two sentences from the cockpit. I need to rethink my allegiance to JetBlue as this is becoming a regular occurrence. Also, they need to rethink the pet policy. We have dog sitting next to us that has been in a carrier this entire time and is not comfortable. And I am travelling with a son who is allergic to dogs and on Benadryl now. I think passengers should be informed of animals prior to boarding so we can make a decision on whether or not to get on the plane.", "num_found_useful": "13"}, {"ratings": "5.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "The JB representative could not have been more helpful when we had to change our tickets due to my partner's medical condition. We even got a credit for our new tickets. We were completely satisfied with the considerate, efficient service Jetblue gave us.", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1451624400.0", "review_description": "I was at my gate in Fort Lauderdale 35 minutes before my flight. On my ticket, on the screens and in the gate there wasn't any notification that there had been a gate change. Needless to say me and others walked around to find out that an announcement had been done but no changes had been put on message boards. Well we missed our flight and the gate agent was very unprofessional in her attitude. This is the first time in all my years of flying that a gate change was so poorly notified.", "num_found_useful": "9"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "My uncle died, so I'm flying out. A representative told me I'm qualified for a discount but I'll have to rebook. I called within the 4 hours so I could of cancelled. I was about to cancel and rebook at a later date but he said, \"No, just call back tomorrow when you can recharge on a different credit card.\" Tell me how these ** don't want to refund my original charge. So they're forcing you to fly with them.", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " OH", "review_time_utc": "1451624400.0", "review_description": "My name is Sri and I recently got married in India. My wife and I came to United States on Feb 8 with 4 checked baggage. We started in India with Emirates and reached Boston. We collected our baggage at Boston and transferred it to Emirates transfer desk at Boston for our Domestic flight with JetBlue (Boston to Cleveland). When we reached Cleveland we got only 2 bags and we reported two bags missing to JetBlue representative. We got one of the bags next day and they (JetBlue) said the 4 bags might come in next flight. So I called them every day for the next 5 days for my 4th bag and every day they said they are hoping to get that bag in next flight. JetBlue wait for 5 days before they escalate the issue to next level (company policy it seems).We were very excited to start our future in USA but I never imagine our earlier days in United States would just be worrying about the one lost bag. People might say out of 4 they lost 1, so not that great deal. Yes, it is a great deal because my wife WEDDING DRESS was in that bag along with her expensive Indian dresses (called Saree) that we need for Festivals (special occasions). She is crying every day because she lost her wedding dress. I try to console her everyday and try to reach both JetBlue (who don't care much about my personal issue) and Emirates (who just say I have to contact JetBlue only) to get an update on my lost baggage. My wife and I got into small fights over this issue because there is no update on bag and she keep crying. I am a PhD student, preparing for my qualifying exam and in last 10 days I was not able to concentrate on my studies as all my time goes into calling JetBlue and Emirates and preparing for lost baggage claim (as JetBlue declared it lost bag after 7th day). Worst part is I am trying to collect bills/receipt for all the things we lost in that bag as JetBlue need receipt for the claim or else they may reject the part of claim (I guess). Moreover, I lost about $2500 to $3000 worth of luggage and I don't know if JetBlue/Emirates going to reimburse all that because their limit is $1500 for international flight (how is that fair to me?). Also, how will I get my wife wedding dress back. Thanks to JetBlue and Emirates our early golden days of marriage would be forever remembered as our early fighting days of marriage.", "num_found_useful": "10"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1451624400.0", "review_description": "I found out late that JetBlue has a 30% change of their flights being delayed! I wish I had known this before I booked with them. I was surprising my amazing husband with a trip to Vegas for Vday. Our flight was suppose to leave at 5:45 pm and arrive in Vegas at 7:10 pm, as I had purchased $500 tickets to see Mariah Carey 8:00 pm show. So, just as I was about to print off the tickets, I get a notice stating our plane was delay and would not arrive until 8:45 pm!!! Are you kidding me!!!I called JetBlue and asked if I could get a refund since their flight are delayed and we would miss our show, they said, they don't offer refunds when the delay is due to the weather. Hmmm, all the other planes were leaving on time so I find this excuse a little hard to believe, so I figured, I wouldn't focus on the negative, simply look for a solution. So I had to tell my hubby about my surprise trip for him, bummer! Together, we looked for more flights and Southwest came to the rescue, we were able to book a flight at 4:50 pm and arrived at Vegas 6:55 pm.We had a fabulous time and now it's time to return home on Jetblue. Our flight was suppose to leave at 7:10 pm, well, I get a notice, this flight is delay until 8:25 pm, then another text - it's delayed until 9:45 pm. Then another text - it's delayed until 11:00 pm, really??? Then we get on the flight and something is wrong with the air conditioner so we had to sit on the plane for an additional 30 minutes!!! If you're traveling and time isn't an issue then JetBlue will be good for you, but if you are connecting or need to be somewhere on time, you better factor in the 30% delay factor!", "num_found_useful": "14"}, {"ratings": "1.0", "reviewer_location": " CT", "review_time_utc": "1451624400.0", "review_description": "We would like to request a full refund for our flights. We missed our flight. Our flight was late and we went to get dinner for our children, because the flight was late. Then we were given 10 minutes notice that the flight was leaving. We had opted to purchase dinner for our family of four and were not given adequate time to board the flight and were rushed. The staff at the airport were rude and unprofessional. They closed the door to the bridge even though there were at least 30 people waiting on it to board the plane. Stating that we missed boarding. When I attempted to open the door that they shut in front of us they said that was illegal and they would call the police if I tried that again. I begged the supervisor to open the door and take a peek at all the people waiting on the bridge to plane, and let us on the flight. She would not even take us seriously. Treated us so poorly (we are not rich, flights are very expensive for us). Gorge at MCO, was notably uncomfortable with our upset children and didn't understand the needs of a family. After hours of phone calls, we were put on the next available flight, which wasn't until the next day. We were not compensated for boarding for the night, nor transport to/from airport, and therefore had to sleep on benches in the airport. We were given a 45$ credit per person, which is good for only one year. We are requesting a full credit which would be about 95$ per person. We fly Jetblue frequently. Although we have heard complaints about late flights and rushed boarding/lost luggage from friends, we have always been steadfast customers. Unfortunately full credits are the only compensation that would allow us to continue to be customers of this airline. We are true blue members (fly Jetblue over other airlines usually) and could not be more disappointed with this experience. We hope that they will compensate us adequately. To be determined.... after reading all of the complaints here on Better Business Bureau... I am not holding my breath....", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1451624400.0", "review_description": "When I had to cancel a flight scheduled for January 2014, JetBlue would not refund any of the balance. Instead, they retained nearly $700.00 of the over $1,000 for our original tickets (two tickets) and put $333.98 in their \"bank\" for future use. I just logged in to check the balance and find that they have \"expired\" it as of 10/28/2015. I do not recall being advised of an expiration date on our cash being converted to their credit, nor any warning they were about to do so. How can they convert our paid cash into their \"credit\", and then expire it? We lost nearly $700.00 when we cancelled, and now find out they have taken the remaining $333.98 as well.As you can imagine, we will NEVER fly JetBlue again. Have filed a formal complaint with the DOT, and of course we will make sure other customers and potential customers are aware of this unscrupulous policy and behavior by means of posting on any and all ratings sites. Hopefully no one else will fall victim to their deceit, and will also decide not to do any business with them.", "num_found_useful": "12"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1451624400.0", "review_description": "About 10 am on Friday, 2/05 (the day of the flight), I received the first of nine itinerary changes (including two gate changes) to Jetblue Flight 1792 scheduled to leave JFK @ 2:51 pm that my son was booked on to come to Florida for the weekend to celebrate my 68th Birthday. The first of many calls to Jetblue blamed the delays on the weather in Chicago where his plane was coming in from - this despite that the weather in Chicago was cloudy and 37 degrees - 20 degrees warmer than the normal daytime temperatures in Chicago for early February! Finally after being at the airport for more than 9 hours, and running back and forth between supposed gate changes, we gave up.A call to Jetblue for a ticket refund (and more time on hold - this one for 22 minutes), I was told that since the flight still had not been cancelled I was entitled only to a \"credit\". That the US government allows this unregulated industry to treat customers with such disdain and with absolutely no recourse, is unconscionable! And as if to add insult to injury, at some time after 1 am in the morning, my cell phone beeped with a message that Flight 1792 was now scheduled to arrive at 2:17 am into Ft. Myers! Not that Jetblue, and perhaps even the Transportation Department cares, but the once-a-year visit by my son to visit me is off for another year...", "num_found_useful": "8"},
{"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1451624400.0", "review_description": "I missed my flight at JFK at Terminal 5. The worst customer service ever. I dealt with DeeDee who started off with a terrible attitude, then waited 15 minutes for Neesa to help, She helped 5 other people and after another 17 minutes told me it was too late. Waited while a nice rep tried to get my refund and asked for the supervisor Kevin to help. He was the worst because he was the supervisor! Now I have an 8 hour layover and got a $74 credit for a $209 flight I bought. I already had a ticket for the later flight but paid the $209 to avoid the layover. I will never fly with them again.", "num_found_useful": "10"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1451624400.0", "review_description": "On January 4th 2016 we were traveling from JFK to West Palm Beach. We arrived one hour before the flight which is standard. After obtaining tickets from the kiosk we were instructed to get on the baggage check line to check our bags. After 10 minutes it became obvious that the line was so long it would easily take over an hour to reach the check-in counter. Fortunately, someone suggested checking the bags at the curbside check-in. I jumped out of line with our bag, went outside and paid the the $2.00 fee to check the bag. We could not have made our flight any other way. I really do not understand JetBlue's reason for doing this as previously they had an agent tagging bags at each kiosk group and then you would just carry your bag to a conveyor. I will never fly JetBlue again. Also, on a side note, the in flight announcements by flight attendants on two different flights has taken on the tone of \"too cute /childlike\" as if they are talking to kindergarten children. Very annoying!", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1451624400.0", "review_description": "Jetblue is not willing to provide good customer service. Jetblue alters their prices for the same flights from higher to lower depending on the days of the week. When a customer books a flight and then notices the same flight has now become lower in price or points, they are not willing to compensate the difference! My recent bad experience with this airline has made me rethink not flying with them in the future!", "num_found_useful": "7"}, {"ratings": "1.0", "reviewer_location": " Other", "review_time_utc": "1451624400.0", "review_description": "Brenda and Nada at JetBlue's Utah's Main Luggage Claims Dept. was absolutely no help whatsoever and extremely confrontational and unprofessional. Our nightmare started at Logan Airport, JetBlue's Ticket Agent whom placed another customer's luggage tag on our luggage. Long story short, 7 days later, multiple phone calls from us (my husband and I) from Puerto Rico, we finally received our luggage. Wheels all broken...Every time we got Brenda and Nada on the phone, they would not tell us the status of our luggage. They told us to call JFK, Jamaica and the Claims Dept. in Puerto Rico on our own. Never once offer to call them themselves. We requested to speak to their Supervisors and they refused. JetBlue's online claims status did not update anything in 7 days. Christian in the Utah Office was the only person that help us. He was very professional. We had to call and hang up many time until we got him on the line when we called Utah. JetBlue, you really need to terminate Brenda and Nada. Listen to their recordings, see how they speak to \"your customers.\"", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1451624400.0", "review_description": "My high quality Samsonite suitcase was broken twice on a round-way trip from SJC to JFK within 15 days. The broken areas are on the case body and handle stick. They both were made by aluminum alloy. I couldn't imagine how that happened? As a result, JetBlue only sent me a $50 credit toward to next trip but I will never take this airline in my life again. The same suitcase has been used for years in other airline companies without any issue. Even though this is first time I took JetBlue that's bad enough to avoid it.", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1451624400.0", "review_description": "December 27, 2015 at approximately 5:30 am, we attempted to obtain our son's boarding pass for his prepaid ticket from the kiosks. The kiosks would not give us a boarding pass so my husband, my 12 year old son and myself went into the line we had queued up in on previous occasions, it is marked for customers with boarding passes only who need to check baggage. We had our ticket, but the boarding pass was not obtainable from the kiosk. We were checking baggage. Although we did not have a boarding pass we had used this line previously as instructed by JetBlue Staff to check in our minor child who was flying alone. Our son flies to the east coast two to three times per year and we have used JetBlue for his flight service on many occasions so we are familiar with this carrier and its policies.One of the agents yelled out \"Do you have boarding passes\" in a very condescending and aggressive manner, my husband answered the ticket agent \"No, sorry the machine is not working\". The man once again but louder replied \"then you're in the wrong line! Get into the other line!\" Everyone, stunned and looking at one another paused for a moment not sure how to respond. My husband then spoke up \"But, this is the line I have been told to use for my child who is traveling alone.\" The agent once again in a more aggressive tone said to our family \"No, you need to go to the back of that line!\" The counter rep just stared at us as a means of intimidation. Now, we're feeling a personal attack for reasons unknown. My husband said \"that's ok, I'll wait to speak to another agent.\"The bullying and aggressive behavior did not end there. The agent Cisco then puffed up and said \"Get to the back of the line.\" My husband asked for a manager and neither agent would call for a manager and ignored the request. A female agent told the two men \"If a customer asks for a manager you have to call for one\", the first agent said he wouldn't call so the female agent made the call even though she wasn't officially open and available to assist customers. She then informed us the manager would not be available for 15 minutes. Side note: When flying out of LAX 15 minutes is cutting it close due to security lines potentially taking as much as 45 minutes or more.The manager eventually emerged holding a cup of coffee, dressed casually as if he was pulling bags off of planes on the tarmac. His demeanor was put off from the start as we began the conversation. He did not want to assist us and never listen to a single word we had said to him. His response when we wanted to file the issuance with the reps regarding proper conduct and customer service was he said that he felt that we were a threat and would not take a report about the customer service and he would not allow our son to fly. Our customer complaint would result in our being restricted from flying that morning.This seems to be a common occurrence due to heightened threats allowing airline staff members to arbitrarily make decisions based upon their particular mood to threaten consumers to do what they say and don't rock the boat or they will lose their right to fly. Additionally, we had paid extra fees to have the services JetBlue offers for minors flying alone, but none of those services where offered on this particular morning, only threats toward us and coercion if we did in fact complain.My husband whispered to me \"Stop. He's crazy, he will take away our ability to fly.\"", "num_found_useful": "17"}, {"ratings": "1.0", "reviewer_location": " NC", "review_time_utc": "1451624400.0", "review_description": "Flight was very delayed, no room in the overhead compartments! The in flight entertainment did not work. This was the worst JetBlue flight I have ever had!!!", "num_found_useful": "7"}, {"ratings": "1.0", "reviewer_location": " Fl", "review_time_utc": "1420088400.0", "review_description": "My wife and I have flown with JetBlue for many years. The flight we had on Dec 5th was worst experience we have ever had on any airlines. Problem my wife and I were in seats 16D & a6E, my wife was also in a cast for a broken foot. Right before takeoff a OVERLY EXTREMELY LARGE individual Sat in 16F. As he forced his way into the seat he lifted the armrest. At that point I told my wife to put the armrest down which was impossible since it was basically in the middle of his back (I would not exaggerate this). We tried to be polite and left our armrest up so my wife could sit halfway in my seat. This was not feasible since she had her leg in cast due to a broken foot and asked for attendant assistance. Was treated badly for asking for another seat and was told their company policy treated oversize people as disabled/handicapped, and if I wanted another seat I would have to pay.I said no and told them that the armrest should be put down because we paid for a seat between the 2 armrests. They told us to wake the individual and deal with him. I told them that was their job. Bottom line my wife and I were put at the forefront of JetBlue's company policy toward obese people. If the company feels the people are disabled or handicapped, they should make accommodations for them at their expense not mine. If this has happened to you and you feel you were discriminated against by JetBlue, please reach out for a possible class action lawsuit to force them to reimburse customers such as myself, and to pay and accommodate for these people themselves.", "num_found_useful": "16"}, {"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1420088400.0", "review_description": "Will never fly with this ** airlines again! Be careful when you fly from Boston to the West Coast. Their planes could not carry enough fuel to fly that long distance and they will divert somewhere to add fuel. THIS WILL EASILY RESULT IN A DELAY OF 2-3 HOURS!!! Our flight from Boston to LA was scheduled to land at 11:08 pm in LA, but it was diverted to ABQ and delayed for two and a half hours. Before the plane took off in Boston, 7 of us who had connection flight to Beijing were told by JetBlue that we would be taken care of in LA. I missed my Air China connection flight due to the delay of JetBlue. But when we finally landed at the airport in LA at about 1am, nobody helped us out whatsoever. We went back and forth and finally found a person to change our tickets. The representative was rude and acted like it was our fault that the flight was delayed. When I asked her about accommodation for the night, she said we need to find our own hotels or stay at the airport for 12 hours to wait for the rescheduled flight! When I called JetBlue customer service, they said they don't have control of the customer service at the airport and could do nothing. It was Christmas night and we were at the airport for 12 hours without any help! Worst experience ever!", "num_found_useful": "11"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1420088400.0", "review_description": "The combination price is a good for hotel and flight. However, the hotel, Crowne Plaza was a wreck. The rooms are updated but unkempt. You don't get cell service in your room unless you purchase Wi-Fi. That's 9.99 daily!!! Then, no views of city as it says in package deal and our room was average, not upgraded as expected. Please know the hotel is a complete flop! The airline was disorganized esp with the delays. Also, JetBlue can check you in randomly to go through fast track TSA while your spouse is the regular line. No sense at all!!! Very frustrating. Terrible airport for a major city. Rethink package deal.", "num_found_useful": "2"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1420088400.0", "review_description": "I traveled on JetBlue from LA to JFK. But since the flight got delayed, missed my next flight to Abu Dhabi. I got my flight rebooked for the next day and jetblue was supposed to provide accommodation for the night. They made me wait 5 hours at the counter and started shouting when asked about hotel accommodation for the night. Seriously bad customer service.", "num_found_useful": "11"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "I arrive at John Hancock airport on time (an hour before flight). Me and my other half had a little extra time to grab a bite so we did. At about 11:00 am the first notice of delay was for 12:15 which eventually escalates to the departure time of 4:45 pm est. We have another plane that has to be caught at JFK at 5:30 pm est. We arrive on the tarmac at 5:45 pm est and the pilot announces the steering mechanism must be bad so we have to wait for a tow. By the time my plane is at the concourse it is 6:08 pm. We have missed our other segment to Belgium and finally after arguing with the Jet Blue counter we are directed to the Aer Lingus counter which the gentleman was a gem getting us tickets for a later flight. The security line at this point is a melee and would be difficult to navigate due to the time constraints we were under. So we proceed to miss our scheduled connection flight. Jet Blue counter here we come again. No possible flights back to Syracuse until next day or day after. I took the bus home, and my other half stayed for the next flight which was 2 days later. My other half was met at the counter by an employee named Sh****a who when asked to call and see if she could get the correct information told my other half to call Jet Blue and refused to write the number down and took off her badge so the possibility would exist that her name would not be recognized. As my other half was walking away from the counter fortunately within sight of a superior Sh****a said, \"** off.\" I am already furious as it were about our experience. Next night my other half calls Jet Blue and is referred to someone named supervisor that will not give any information and refers to us as, \"you people.\" At this point we are told that we would receive 300 points in credits only and provoked daunting sarcasm from \"supervisor\" to state, \"well you can always email customer service and that is as far as you will get.\" My call to customer service to assess the situation today has been a total waste of time in knowing that I am out about $3500.00 USD after this crap and that Jet Blue are a bunch of bigots on top of it. I could not recommend this airline to anyone. First excuse from Jet Blue about the delay was that someone deplaning at JFK had a pair of scissors. Second excuse was a combination of security and weather when there is not even a cloud in the sky. The final excuse was the truth that they had overfilled the fuel on the aircraft and had an engine problem with no replacements (they stated) for the day available so they had to fly it from Boston back to Syracuse when the engine was repaired. They did me worse than Delta.", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "I fly Jetblue between Fort Lauderdale and NY regularly. From Fort Lauderdale there is constant delays mostly due to crew or pilots being delayed somewhere else. It seems to me the company cuts it too close possibly to save money but this causes delays every time. After about ten times in 6 months I am now thinking of switching to Delta or Southwest and hopefully flights will depart on time. Jetblue is generally a good airline but there is something being mismanaged with regard to coordination of crew between flights.", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "There was a Jewish man walking back and forth like 5 times and then he went to the front of the airplane next to the exit door for about ten minutes (praying) the flight attendants didn't tell him anything. A lot of passengers were scared thinking he might try to open the door. Flight B61601 JFK to FT Lauderdale 4:55pm Monday November 23.", "num_found_useful": "2"}, {"ratings": "1.0", "reviewer_location": " NV", "review_time_utc": "1420088400.0", "review_description": "I have never had a gate agent tell an active duty navy pilot that they don't care if you're military at this airline. Phoebe (gate agent) in Reno Nevada was who we dealt with. I am 6 months pregnant and my husband booked our tickets home for thanksgiving while still deployed. Unfortunately the stellar JetBlue website has an error when he went to select our seats. We both figured that we would be ok when we got to the airport due to all other airlines being military friendly and putting our seats together. Not JetBlue. Phoebe stated that she was sick of military favors and she was giving us middle seats. She was very abrasive in her statement. Please do not idea this airline if you have any compassion for our military.", "num_found_useful": "9"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "I traveled for a weekend with JetBlue flight 609 leaving JFK to Sto Domingo on 11/5/15 and returning back to JFK NYC with flight 310 on 11/9/15. Accordingly to JetBlue customer service at the Las america airport and my luggage did not arrive with me. It took so many phone calls and visit to the airport in Santo Domingo and after I called JetBlue in NYC, finally I received my luggage which was very empty. I was very disappointed to have travel with JetBlue. My luggage was returned back to me on 11/7/15 in the night and my luggage was almost empty. Almost everything was taken from my luggage. I had to purchase most of my things that were in my luggage which I had in my luggage, but not longer was there as they were taken by JetBlue staffs at the airport in Santo Domingo. I will never travel in this airline and I will advise everyone not travel in this airline even if the airline ticket was free. Also, I will advise to anyone who is planning to travel to Santo Domingo not take any luggage on JetBlue cargo. I will give a rating of minus 10 (-10) stars. To those people who are thinking of traveling in JetBlue to Sto Domingo, please be aware of the bunch of staffs thieve that work at the airport. JetBlue staffs in Santo Domingo are the worse staffs ever. This happened for buying tickets for the lower price airline. It was not worth the headaches, and losing my belongings as well as all of the gift that I bought for my family and somebody else took them. My luggage was broken too. Santo Domingo airport only has thieves working there by the bags department. Like I said I will not travel in JetBlue airline ever again even if the ticket was free.", "num_found_useful": "5"}, {"ratings": "5.0", "reviewer_location": " MA", "review_time_utc": "1420088400.0", "review_description": "Miguel ** would one of the most helpful people I have worked with at any airline. When I had an issue with my ticket and was almost unable to take my vacation flight, he resolved the issue and get me to my flight on time. The flight and flight crew were great, on-time, and I watch 2 full movies free! A great way to fly!", "num_found_useful": "5"}, {"ratings": "2.0", "reviewer_location": " MA", "review_time_utc": "1420088400.0", "review_description": "I was in a flight from West Palm Beach, FL to Boston tonight! I got delay and switch around! I was ready to board the plane, this obnoxious employee at the counter called Cristopher was chasing and harassing customers over their carry-on. He entered the airplane and started tossing and pushing bags around. Everyone notice how obnoxious he was and started laughing, the crew members became uncomfortable with the whole situation! He proceed to picking up the aircraft's phone and started overhead paging that people should check their over-sized bags! God help me! After a trip that started with a cancellation and proceed with delays in the flight home, all I need was a good laugh! I'm disappointed and extremely unsatisfied with JetBlue. No compensation was offered for the cancellations and delays I had! JetBlue, two thumbs down for you! You suck! PS: The flight attendants were great!", "num_found_useful": "5"}, {"ratings": "3.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "You should have more leg room in the front seat. I have problems that I can't sit right so I needed more leg room but there wasn't. The animal crackers that they was old.", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " NH", "review_time_utc": "1420088400.0", "review_description": "In May 2015 one of my suitcases didn't make it back to Boston or was taken. Jetblue required me to document every single article and show its value in receipts. First, who can remember everything they had in the suitcase? I eventually remembered several items I had not submitted to them and even though my case was not finalized, I was told basically \"too bad\". Once I mailed off the list, it was a final claim to them. Who saves all their receipts for sandals, jeans, pocketbooks, etc? Not me! They did accept the statements from Macy's I had on some of the articles and I lost out on all the rest. ROBBERY! A really proud moment for Jetblue.", "num_found_useful": "5"}, {"ratings": "1.0", "reviewer_location": " CT", "review_time_utc": "1420088400.0", "review_description": "We were coming back from our vacation. Stewardess did not provide proper service. When I complained (not aggressively) she got really upset, started yelling that I am breaking \"airline law\". By the end of the flight, for no reason, she called police security on me. My wife and I were humiliated and my vacation was ruined.", "num_found_useful": "13"}, {"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1420088400.0", "review_description": "Pets on planes. For the second time I was told if I was allergic to animals I had to take another flight. The last time this happened I lost my free first class upgrade in favor of... a cat. When I talked with Delta, they listed my allergy, then? Permanently revoked my automatic upgrade status because of allergies. I had to have it changed after not even being informed they had done it over three flights. I am not one for litigation, but this seems to be against federal law. I had a federal prosecutor friend of mine send me the ADA rules stating that we cannot be denied services on any transport; cabs, trains, planes, etc. But... it keeps happening to thousands of Americans. I asked them what they are going to do with a 12-yr old child who gets their first anaphylaxis shock at 36,000 feet. They had no idea. The gate agent said \"We hope and pray someone has an EpiPen... but, the pet has more rights than people allergic.” Do we wait for someone to die for a comfort cat? I am starting a website and email for \"People before pets.\" I am going to see if we can get stories of kids with early onset allergies as well as other passengers who keep getting kicked off planes in violation of federal ADA laws. Then see if we can sue multiple airlines.", "num_found_useful": "11"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "This is to complain about the poor service and lack of communication during my flights (September 27th) to, and most importantly, home from the Dominican Republic on October 3, 2015. First and foremost, on my way to the airport the complimentary movies did not work so we were told that we would get a credit of $15.00 sent to our emails which we never received.On our way back we were told to arrive 3 hours before flight departure in order to check in our luggage which we did. The Jetblue system went down for at least 3 hours. Airport personnel lied to me stating that the entire Airport's system was down but all other carriers were operating. Then, Jetblue took care of flights leaving early before those of us who had been waiting even though those flights were not scheduled to leave until after my plane departed. In addition, we sat for over 3 hours without air conditioning and employees did not have the decency to communicate with us on what was going on or made it a point to avoid us. I have put pictures of the baggage line so long that people were standing on line outside the airport. I also have pictures of other customers on line sitting on the floor and even one man was laid out on the floor on his stomach.There were no signs directing customers to the express speed line or anyone to ask, for which I paid $100.00 for myself and my partner. When we finally got to the front of the line, I was told that I could have gone through speed pass. What did the staff do? They just laughed. Once getting through Security, the gate did not have our flight listed on the screen but other flights were listed including other Jetblue flights. I pointed this out to a Jetblue employee but she looked annoyed and ignored me. The departure screen listed my flight as leaving at 1:06pm and boarding time of 12:30pm, however, we did not board the plane until 2:30pm. By then everyone was in a frenzy because it said that our flight departed! I have included pictures for you to appreciate what we went through on this day. It was so bad that a passenger made himself a Cup O Noodles while waiting on the line.I will point out that the Pilot did inform us that there would be a wait until the proper paperwork was submitted. Both the pilot and flight attendants were apologetic for the travesty that occurred on the ground and I do appreciate that they did speak to us and kept us informed. I have always traveled only on Jetblue because of the past excellent services. I have always praised for airline and recommended it to all my co-workers, family, and friends. I even opened a Jetblue American Express credit card so I could earn points to fly Jetblue. I am requesting a refund of the cost of my flight and that of my companion. Otherwise, I will have to reconsider whether I will continue using your services and will cancel my American Express card immediately. This delay that occurred had nothing to do with the weather, it was all because of the incompetent Jetblue Punta Cana airport staff and system all together. I will NEVER go to Punta Cana again after this whole ordeal. I am a Nurse and being delayed because of others' incompetence is not acceptable. Just like in my profession, it is my responsibility and I pride myself to treat patients with respect and when I pay for a service I expect to be treated the same. After speaking to Jetblue, I have attached their appalling Customer Service. They do not care at all about their customers.", "num_found_useful": "12"}, {"ratings": "1.0", "reviewer_location": " PA", "review_time_utc": "1420088400.0", "review_description": "I am writing to you to file a complaint against JetBlue Airlines and it will be highly appreciated if you could coordinate this issue with the Airlines concerned. My husband, my daughter and myself traveled from Chicago to JFK, New York on 9/6/2015. Our flight #906 from Jetblue Airlines was canceled for their maintenance reason. However, we did not get appropriate notification. Instead, I received an email from JetBlue with a Mobile Boarding Pass on that day. The airport representative Ms. Sylvia from JetBlue tried to offer us a full refund because of the cancellation on their flight, plus another available flight from Chicago to NY (JFK) would be 2 days after, which is not acceptable as my daughter would start school. We would accept their refund. But after Ms. Sylvia made a phone call at the front desk, she totally changed. She told us that we had to find another airline by ourselves, and JetBlue can do nothing about it. At that moment, obviously we could not find affordable tickets in last minute. JetBlue would not cover anything, and the costs would be on our own. My whole family was abandoned at Chicago airport!! And finally we had no choice but renting a car to drive back. Our little kid got car sick after 15 hours drive! The ticket is a contract between airline and customer; but the airline did not fulfill the service of the contract totally and leave the helpless customer alone at airport; this business conduct is fraud and unethical.", "num_found_useful": "13"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1420088400.0", "review_description": "CAUTION: Booked flight through Orbitz. Had confirmed seats both ways, Tampa to Boston. On the return flight, they decided to book me and my wife in separate rows in the middle seats. We showed them confirmed seat documentation. They said too bad that it was not booked directly with them. The agent at the ticket counter said to speak with the agent before boarding, that they had control of the seating, and maybe they can do something. Now the real story... the agent at airside was not only rude and nasty, had a thick black beard, said that he could seat us together for an additional $110.00. This is the game of Jet Blue. Now I had to pay this. No choice if you want to sit with the person you are traveling with. Now I understand why Jet Blue goes out of their way to hire the most rude and nastiest employees. Only one person gave a little smile on the return flight. After calling customer service at Jet Blue, they could care less. Offered a $25.00 credit for a bag fee on the next flight. A next flight on Jet Blue will \"NEVER\" happen for us. I will use our other airlines that show a shred of common decency. I am afraid of their maintenance of their aircraft and safety with this kind of company. If they have such a crappy attitude, how safe are their planes? The attitude is blessed from their corporate office. Just a heads up from a frequent flyer. Back to sane airline travel on America, Delta, Emirates, etc. Toilet time for Jet Blue! Cheers.", "num_found_useful": "10"}, {"ratings": "2.0", "reviewer_location": " WA", "review_time_utc": "1420088400.0", "review_description": "I flew Jetblue on Friday, September 11th, and then back on Monday. It's the first time I've flown this airline since they started charging for checked bags. A great deal of the passengers were loaded with several pieces of \"carry-on\" to avoid the $25 check baggage fee. I almost always do carry-on so it was no change for me, except suddenly the bag I've always used didn't fit quite right in the bin and I warned they may not accept it next time. I also ended up sitting several hours in the airport before my return flight where I witnessed at least 4 flights that the last loaded passengers were forced to check baggage since the bins were full for the cost of $25. So if you're seated 6-14, there's a good chance you'll have to check your bags for additional fee of $25. Could you imagine dropping your teen off for a flight only to find out they were forced to pay $25 to get on the plane? Now imagine they didn't have the money... Or anyone not prepared for this price gouge. Plus if you add $25 to the base ticket price, Jetblue is no longer the best choice. Not worth the $25, Jetblue, with how unhappy the many people in seat 6-14 were... Bad move. I took pictures of each group refused free carry-on luggage room.", "num_found_useful": "7"}, {"ratings": "2.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "Rude in-flight service staff and poor service on flight 1817 on 9/7/15 and flight 1818 on 9/8/15 to Port of Spain from JFK. These were middle age white male stewards in front of the plane. I asked for a soft drink twice and passenger near me had to ask 3 times and answer was a stern, \"you have to wait.\" When drinks were brought, there was angry look on his face (flight 1818).", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1420088400.0", "review_description": "Second time I fly with JetBlue departing from Fort Lauderdale, second time my flight is delayed.... First time going to Bangkok I have literally run from one get to another so I wouldn't lose my connection, they didn't even offer a shuttle to get us to the door! 2 hours delayed! Today guess what... second time (this time going to Boston) they first delayed from 6.17 pm to 6.50, now till 9 pm... well done JetBlue you just lost another customer. Do not fly with JetBlue, there are 99% chances that your flight will be delayed!", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "My husband and I took a trip to Cancun on 9/5. The flight was delayed for almost two hours. Our seats were filthy and the serving table was nasty with coffee stains. I doubt they ever clean their plane. On the ride coming back was even worse. It was perfect weather and the landing was not only shaky and rough, but we felt like the plane literally dropped on the ground with a harsh brake. People were holding on to the seat in front of them due to the rough landing. I'm 5 month pregnant and I do not recommend this airline for anyone especially pregnant ladies. I used to take Aeromexico to Cancun, but thinking JetBlue has such great reviews and more legroom I decided to give it a try. It was the worst decision ever made.", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1420088400.0", "review_description": "Baggage handlers at curb side check in - All of the White, Hispanic and black Americans have been replaced by Haitians. They refused to help me get bag out of trunk and we're talking in Creole the whole time to each other. This was at the Fort Lauderdale airport in Florida so I felt quite Uncomfortable. Outsourcing is only a form of discrimination in America.", "num_found_useful": "4"},
{"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1420088400.0", "review_description": "Booked a flight in January for end of march. Cancelled flight end of February. Charged $150 for cancel fee and remaining amount went to a jetblue \"bank account\" as a \"credit\" with their airline. How is this legal?! I could understand cancellation fee if my money was actually given back to me to do with what I please and short notice, but Jetblue is still benefiting from the fact that I gave them a months notice to cancel and will charge a greater amount to someone else. Not only that, they are holding my funds against my will to use for their airline and it expires if I don't use it for 1 year. Seriously, how is this legal?! Is there a consumer class action suit of some sort against Jetblue that anyone knows about?", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1420088400.0", "review_description": "Returned from an international flight through JFK and needed to re-check baggage for Orlando. Jetblue lost bag to MCO with time-sensitive content for a wedding in 3 days. Jetblue's Orlando lost-baggage office staff are horrendous to deal with. Unprofessional, unsympathetic and often outright rude to the already-distressed passenger. It took my personally calling the international carrier's foreign offices, JFK's ground baggage handling crews and Jetblue corporate office for 5 days (with absolutely no effort or assistance from Jetblue's MCO office, other than hostility) to finally locate the wayward bag. Then it took another DAY for Jetblue Orlando to deliver it. As a result, lost a huge investment for the wedding which will need litigation to recover. Lesson learnt: If flying Jetblue, carry-on baggage only!! Truly disheartened on what I previously considered a quality airline. Live and learn.", "num_found_useful": "4"}, {"ratings": "2.0", "reviewer_location": " NY", "review_time_utc": "1420088400.0", "review_description": "JetBlue terminal in LAX does not have a family bathroom. I'm In a wheelchair and they had to clear out the whole ladies' room so my husband could help me. If you have a young children, you have to take them with you or leave them on their own.", "num_found_useful": "2"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1420088400.0", "review_description": "7 HRS late so far.. engine trouble...? Funny the incoming plane to SFO landed just fine on time,,... If engine trouble it wouldn't even land SFO. Christian at desk, could care less. We had to \"ask\" about dinner....now RED EYE getting in 8am instead of 11:30PM. Ruin my work day the next day. Sure EVERYONE can sleepsitting up all night. Why not route us thru VIRGIN AMERICA in the morning, with healthy, restful nights sleep at SFO. NOTHING. Never in my life and NEVER AGAIN.", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " NJ", "review_time_utc": "1420088400.0", "review_description": "We were on a flight from LGA to Orlando on the 8th of February 2015, flight 1099. There were a large group of people on board. The two rows in front of ours (16 & 17) were playing cards with money and consuming alcohol all through. There were many instances that we asked these people to keep it low... But their behavior was very unappreciative. We were traveling with our 4 year old.While the flight was landing there was a bottle of water thrown at us from behind by one of the people in this group. On letting the in flight attendants know that we would like to call the cops... they passed on the information conveniently as we would like to complain. We ensured that the cops came but they said per the law they cannot hold back the passengers. When we asked the person/supervisor at jet blue if gambling was allowed. They have the nerve to tell us that those people might just be having fun. We were under the impression that when money is involved it is considered gambling. All that this airline is bothered is how much money they make by way of selling liquor. They care a damn about other customers.", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " NJ", "review_time_utc": "1420088400.0", "review_description": "My 20 year old son, who just experienced the loss of his father, was scheduled to go Boston from the Philadelphia airport. The weather conditions were very bad and there was 2-3 feet of snow in Boston. All other airlines cancelled their flights to Boston. My son had a 10:15 flight which took off and was diverted to JFK in NY at 12:30 pm. He was told he would be on the next flight. He was placed on 2 other planes and each time the plane was emptied, and they were not given any information. He waited in a long line for 45 minutes to be told there would be a 10:55 pm flight. Jetblue never mentioned any accommodations, not provided any food vouchers. The 10:55 pm flight was delayed and at 1:00 am, he was told they were waiting for a crew. They would not give him his luggage nor provide any definitive answers. At 2:30 am, he was told the flight was cancelled and they were all booked for the next day. They left him stranded at the airport, providing no ground transportation to Boston or even back to Philly. They provided no hotel and left him there with no way of getting him to his intended destination. I had to drive 3 hours to pick him up in the middle of the night. I had to use extra gas and tolls to pick up my son because Jetblue would not help him in any way. I also had to pay additional money to book a train the next day because Jetblue had no flights to accommodate him. I called Jetblue and spoke to a very rude supervisor, Tracy #**, who would not refund my money, was very unsympathetic on the phone. She told me that his ticket was used even though the plane was diverted and they would not give me a full refund or credit. I purchased a ticket for my son to go from Philadelphia to Boston. They did not provide this service and take him to the intended destination. They left him for 14 hours with no answers or accommodations. I will never fly Jetblue again and intend to write the CEO to let him know of the robbery that his airline provides. I want to hear from a Jetblue representative and I want this matter rectified. It appears they do not care about their clients or if the person reaches their intended city. Their customer service is horrific and I was never met with such rudeness. Tracy needs to be demoted and retrained in customer service. Remember it is the consumers that provide her with a job. I was very dissatisfied with this flight and will wait for the CEO or someone in administration to contact me.", "num_found_useful": "10"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1420088400.0", "review_description": "On 1/25/15 due to winter storm Juno, I had to purchase two new tickets to avoid a weather cancellation. I changed the flight from 1/27/15 to 1/26/15 from JFK to Long Beach, CA. For two people, this cost me $1,409.76. Jetblue's webpage on 1/25/15 stated: \"Due to winter storm Juno, we will waive change/cancel fees and fare differences for customers traveling on Monday, January 26, 2015 through January 27, 2015 to/from the following cities: New York, NY (JFK).\" The original tickets were bought for me as a gift on a different credit card. The new ticket was purchased by me. Getting a refund has been a humiliating experience, holding on the phone for extended periods several different times, being made promises that were not fulfilled, and unprofessional rude supervisors telling me no are just part of the story.I received $944.88 and was told the $464.88 remainder was put on the original ticket buyer's credit card. I do not want to ask the gift giver to give me back the money. They will not make the correction or a goodwill credit. I have been flying with Jetblue since year 2000 and have never been treated with disdain and contempt until now. Another time I needed a refund and it was difficult but nevertheless accomplished. ", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " NJ", "review_time_utc": "1420088400.0", "review_description": "This has been my 2nd experience flying with JetBlue and will most likely my last mainly due to their horrible customer service. I called to change my flight on the evening of February 2nd at 9 pm due to the inclement weather the past couple of days as well as a storm predicted this upcoming weekend. I needed to change my flight as I could not risk not making it back on Sunday evening. First it took over an hour to get a \"customer service\" representative on the phone and after speaking to them for 5 minutes and informing them of the change in flight, she informed me that there was a $100 change fee with the ticket. The representative told me might be able to get the fee waived however she needed to speak to her supervisor and there was a 30 min wait time for her to speak to her supervisor. I waited patiently and finally after about 45 minutes she came back on the line to inform me that they could waive the fee however at this time the call got disconnected from their end. Very frustrated I called them back and had to wait an hour again to speak to anyone. I asked the representative if she could take my number down in case they drop my call again, however that is not an option as they cannot contact me back even if they lose a call. Once again they had to go through the same process again of trying to contact their supervisor to get the fee waived as they had no record of my previous call however this time the supervisor who the representative spoke to refused to waive the $100 per person fee and informed me that it was up to each supervisors discretion as to if they will waive the fee or not. Extremely livid as I had wasted 4 hours and it was 1 am at this point. I spoke to the supervisor directly and informed them of the whole situation and after another 20 minutes the only resolution she could come up with was that she would try to find who I spoke to the first time and give me a call back today. I have yet to receive any call. I typically have always flown with United and their customer service is always great and changing flights is very seamless. In over 10 years of flying with United I have not had the issues that I had in the 2 times I have flown with JetBlue. Never again.", "num_found_useful": "4"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1420088400.0", "review_description": "I was supposed to take JetBlue flight#101 non-stop out of Fort Lauderdale to LAX on Jan. 30th 2015... due to traffic I arrived approximately 35 min before take-off. I was somewhat optimistic about possibly still catching my flight since I noticed that the TSA checkpoint was unusually empty. I walk up to the counter where a gentleman named Harry, who seemed to me was in a particularly fool mood greeted me. I informed him that I was aware that I am arriving well past the recommended check in time & asked what options did I have a this point.Honestly he seemed more interested in verbally chastising me for my tardiness than actually accommodating me. I asked if there was any way I could run to the gate, an option that has been afforded to me in the past by other airlines, and have my bag placed on another flight to the same destination. He informed me that my ONLY option was to pay the $50 rebooking fee for the next available flight which was the following day. I agreed & while he was making arrangements to do so it occurred to me to ask if flying standby on the next flight was an option. He said \"that's one way you could go\" in a rather sarcastic tone at which point I asked why was this not presented to me as an option from the start.At this point Harry became defensive towards me & stated that I was accusing him of doing something unethical. Realizing that I had gone as far as possible with Harry I asked to speak to a supervisor. Harry reluctantly called over what I have to assume was a supervisor, since he did not present or identify himself as such, named Marshal. Marshal seemed less than interested in hearing what I had to say instead making excuses for Harry without even having consulted either one of us to gather the pertinent information regarding our issue. At one point Marshal said to me that \"Harry most likely did not offer standby cause he checked the manifest for that flight & it was full.\" I asked if he knew that as a fact & how would he know when I knew that Marshal had not taken the time to have either Harry or myself brief him on the current situation. Marshal's response to this was raising his voice while grabbing his walkie talkie & telling me I needed to calm down. I informed him that I was being very calm to which he replied \"no, you're being aggressive.\" I repeated that I was being extremely calm given the circumstances to which he replied \"Oh... and what's that supposed to mean?\" Realizing that he was obviously trying to goad me into saying something threatening to him which is tantamount to yelling out \"bomb\" at the airport these days I said \"I'm not dumb, I know what you're trying to do. I'm not going to do or say something foolish in an airport.\" He then told me \"I wish you would\" & \"I get off at 7:30 pm if you want to handle it another way.\" To which I replied \"I wish I could\"... right away. He smiled & said \"oh you just threatened me!\" & Harry chimed in \"yes he did, call the police.\" I guess I was supposed to panic & run out of the airport leaving everything behind but knowing my rights & the fact I did nothing wrong I smiled & waited for the police. After about 5 min the Fort Lauderdale airport police deemed I wasn't a threat & I was left in the capable hands of yet another supervisor for JetBlue. She must've been trained by the same people that gave Harry & Marshal their training because she pretty much picked up where they left off. At no point was Marshal held accountable for the way he spoke to a customer, instead she was more interested in determining if I was suitable to be placed on another JetBlue flight without incident! I kindly informed her that a police officer, who in my opinion is more qualified to make that assessment, thought so. I also asked her if she cared about the way her ticket agents had behaved towards me. It was like talking to a wall wearing a bad wig. At this point I realized no one was going to afford me any kindness much less customer service so I requested a refund. She said a credit would be issued but no refunds as it is not in their policy. I said this was unacceptable to me for I refuse to give JetBlue any business as long as they endorse this type of behavior towards customers. She said a couple of things under her breath to Harry & reluctantly called corporate arrange my refund. I thanked her & asked for her name as well as the last names of Harry & Marshal so that I may write a letter about my experience, she laughed & told me they do not have last names & that she did not feel comfortable giving me hers. I have never witnessed such a lack of courtesy or professionalism in all my years of travel. Needless to say I will not be travelling with JetBlue again & I will make sure my complaint reaches the highest channels. I am however saddened because the legroom on their flights is second to none & my inflight experience has always been great.", "num_found_useful": "11"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1420088400.0", "review_description": "Jetblue has been worst experience for me. I was flying from TPA to JFK on flight number 326 on 12th Jan 2015. My flight was cancelled due to which I missed my international flight from JFK. I was arranged to another flight #426 and asked by supervisor to stay overnight at JFK airport and take international flight next day. I was okay with it as long as they provide me accommodation. TPA supervisor told me everything will be taken care by Jetblue. However, my 426 flight again got delay and I landed late night in JFK and was treated very badly by the BOS office lady named Tammy. She was talking to me as if she was doing favor by giving me hotel to stay. She asked me to grab my belonging from her office and go to shuttle area. I can clearly see the way of talking coz I notice she was nice to another lady nicely but with me, she was really rude. Why was she rude to me, maybe she didn't like me or there is something else? Wasn't all customer same for the airline's officers? It was one of my worst experience in JFK Jetblue department.", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " MA", "review_time_utc": "1420088400.0", "review_description": "Flew from Boston to Fort Myers; arrived at 12:30 am 1/7/15 and our grandson's car seat arrived broken. There was no one to make a complaint. We called the nested day and went to the airport at Fort Myers with the car seat. We were sent to baggage claim then to ticket reservation back to baggage claims. We were offered a $100.00 travel voucher. That was not going to help us with a baby that needs a car seat to travel in.", "num_found_useful": "8"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1388552400.0", "review_description": "I booked a flight on the phone with Jetblue from Buffalo, NY to JFK for my wife and our two service animals. I had my confirmation number. When I arrived at the airport, the agent at the JetBbue counter told me my credit card had been declined. I told him I had a confirmation number, how could this be. So I called my credit provider to ask why my card had been declined. The woman told me my card was fine. So I put her on speaker phone and asked her to repeat what she just said. Upon hearing her, the agent continued to say the card was no good. This went on about half an hour. Then the agent said I had missed my flight. But that there was another flight he could put me on. So I booked the next flight using a different credit card and boarded the plane. I feel that I was lied to that they had overbooked the flight and had to stall me to keep me and my service animal off the plane. Once boarded, I was putting my carry-on bags in the overhead compartment when this rude female flight attendant orders me to put my service animal - my 90 pound GSD and my 110 pound AmStaff - under the seat. I told her, \"Sure, as soon as I get my bags put away,\" but that wasn't fast enough for her, and she raised her voice at me. \"PUT THE DOGS UNDER THE SEAT!\" At this point, I sat down and ordered my animal under the seat. He stuck his head and shoulders under but his butt was still up on the seat. I told the attendant, \"If you can show me how I'm supposed to put them under there, I'll do it.\" She got angry and stormed off to get a supervisor. Upon the supervisor's arrival, she ordered the dog under the seat. I told her that wasn't going to happen. So they moved me to bulkhead seating where we were more comfortable. Then we changed planes - JFK to LAX. On this flight, there were more rude attendants, One in particular (KEN) who went out of his way to watch us the entire flight to force me to comply when he saw the dog wasn't going to fit under the seat He told me to put my feet on him which made me very angry and I told him to leave us alone. He went away, then came back when he saw my feet on the tray table. He told me to put my feet down on the animal. I refused. He then said, \"Okay, put your feet on the seat next to you.\" So I did for the rest of the flight (for $1,300, I expect to put both my feet on the floor). By doing so gave me a very painful backache. When I got to LAX, I couldn't get of that plane fast enough. JETBLUE NEVER AGAIN! This is no way to treat handicapped persons. This was absolutely the worst flight experience ever for us and I'm telling everybody how I was treated by this airline and its poorly trained flight attendants.", "num_found_useful": "19"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1388552400.0", "review_description": "Booked a flight from Long Beach to Sacramento, CA. Flight scheduled to depart 6:50 am. When I arrived to check in, the person that checked me in, first checked me in, then told me that my bag couldn't go because I missed the cut off by 5 minutes. I said, \"Well, how am I suppose to leave without my luggage,\" and she laughed. I asked to speak with her supervisor and he also laughed with a smirk on his face. Very shallow responses.I understand there are guidelines to follow but 5 minutes, really. Jetblue only flies out to Sac twice a day. My father whom is 81 can't drive at night so no option for me to choose the later flight. When I called to cancel my flight, I was charged a cancellation fee of $75.00. I lost out on $130.00 right before Christmas. That makes me sick... I will never fly via Jetblue again....", "num_found_useful": "15"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1388552400.0", "review_description": "I booked a guest artist on a flight to a Comic Convention I run. Shortly after I booked him a flight he informed me that he had to cancel due to family problems. Jetblue charged me $150 to cancel the trip and then sent travel Credit to the person who was to take the flight not the person who paid. I called them to straighten this out and they said they could do nothing for me. I insisted in getting the money back from the balance, they said they never refund money. After asking for a supervisor she offered me $50 back for the cancellation fee but said she could not put the travel credit I paid for back in my Jetblue account. I booked the flight originally with my jetblue account. I insisted that I should at least have the travel credit in my Jetblue account not the person that was to fly but cancelled. They said they could do nothing. I asked for a higher supervisor. That person yelled at me and hung up. I am wasting a lot of my personal time trying to get this resolved and their customer service is almost no help. I have been a loyal JetBlue customer for over 10 years and always tell others how great the airline is. Something changed recently and it is not good. A few years ago I had to cancel a flight for another guest and there was a very small fee and I got all the credit right in my account. I really liked Jetblue up to this point but they have let me down immensely. I am hoping this extra effort of complaining will reach upper management and they may start to value their long-term customers again. I sure don't want to fly on the old legacy airlines again. What can I do when the only decent airline let you down much?", "num_found_useful": "14"}, {"ratings": "5.0", "reviewer_location": " NY", "review_time_utc": "1388552400.0", "review_description": "We use JetBlue often and have for years. We have never had an issue with the service until now. Our noon flight #752 from Cancun to JFK on November 21, 2014 was delayed and then cancelled because of mechanical problems. We were rescheduled for the next flight #852 at 3 PM. If it had ended there we would not have complained. JetBlue automatically issued a $50 credit to make up for the inconvenience.Long story short... #852, with our luggage, left without us. JetBlue sent us to the Omni, a nice all inclusive Cancun hotel. The next day we were picked up, given a boxed lunch and returned to the airport for the afternoon flight. We were nervous after what we went through, but it went well. We retrieved the luggage and completed the 4 hour...make that 24+ hours trip.We spoke to Corporate Customer Support- actually we emailed DearJetBlue@jetblue.com and Kelly called us back. We were more than happy with her concern and the compensation she offered. It was clear that she really does care about how customers are treated. Nice. The crew in Cancun went out of their way to make a bad situation bearable. I've been flying JetBlue in the US and abroad for years and this experience shows me why they stay #1 in the budget airlines. Will we fly JetBlue again? Absolutely.", "num_found_useful": "14"}, {"ratings": "1.0", "reviewer_location": " Other", "review_time_utc": "1388552400.0", "review_description": "Flew JetBlue Fort Lauderdale to Lima. Booked one way and the website informed me that I will have to show a ticket out of Peru. I am doing a 5 month backpacking travel through south america and traveling by buses and therefore it wasn't clear to me which kind of proof I could bring so I just came to the airport 5 hours earlier so if necessary I can book a ticket online and cancel it later. I arrived and was asked for a proof, told that the buses that I will use for crossing the border from Peru to Bolivia are not bookable online. I was told I cannot take my flight if I don't show a proof. Then I asked if it will be ok if I will just book a flight ticket and cancel it right after, so they will have their proof. The supervisor said yes and told me they can do it for me. At that point I have asked multiple times if the booking is fully refundable, I know I could do a fully refundable one online. They said again and again that it's fully refundable and I could cancel it right after passing customs. So I did and cancelled it once I arrived to Peru. However, they charged me an extra $50 phone booking that they wouldn't refund and never mentioned. Wrote the customer support twice, and they were unhelpful and refused to refund the fees. Now I have to go through the annoying path of contacting my credit card company to cancel this charge. It is not the $50, it's hating being cheated.", "num_found_useful": "9"}, {"ratings": "2.0", "reviewer_location": " VT", "review_time_utc": "1388552400.0", "review_description": "I bought a flight for $69 but I had to cancel and Jetblue told me that the cancellation fee per person is $75. Ridiculous!", "num_found_useful": "11"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1388552400.0", "review_description": "Thanks for refunding our $948 ticket cost for the six-hour-delayed flight from BDL to FLL. The future-flight credits now total $200 but are of no value to us. This was our first and last attempt to fly JetBlue... not because of the mechanical problem... but because JetBlue could have avoided us missing the cruise with our six Florida friends... and does not accept responsibility.Specifically, your staff kept us on the plane for two hours by announcing that passengers should not be concerned about making connections to cruise departures from FLL. BUT, you made no effort to identify passengers at risk of missing cruise connections. AND, while I was in line to talk to gate agent at 10am (vs 7:25am flight time) you announced 1:20pm departure for 3 hour flight. Unfortunately, Regal Princess sailed at 4pm from Ft Lauderdale. Our friends were on board but not us... because of JetBlue human errors and/or policy omissions.I am waiting to hear from Director **.", "num_found_useful": "11"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1388552400.0", "review_description": "I was on a Jetblue flight from JFK to fort Lauderdale. Flight #1201, Seat #17D - 11/22/14. There was two flight attendants, a male and a female. To my attention the woman flight attendant was very rude to a lot of passengers. During the flight I put my seat back and felt asleep. Suddenly I heard the woman flight attendant coming down the aisle telling everyone to put your up. Before I could open my eyes I felt a folded fist punching me 3 times in my left shoulder, \"mam puts your seat back up\" in a loud voice. I jumped up in shocked that the woman put her hands on me in a aggressive way. I said, \"excuse me, don't, why did you hit me so hard?\" The Jetblue flight attendant turn to me and said, \"it's for your safety.\" I then said to her, \"you can't do that.\" She then proceeded to tell me with finger pointing to me, \"mam I'll make somebody meet you at the door.\" The passenger in front of me ask the flight attendant if he could use the restroom and she said yes, so why would you punch me so hard to put my seat up and I'm setting down with my seat belt on then you let someone get out of their seat to use the restroom isn't more dangerous? Now I have a pinched nerve in my neck because of how I jump up so fast. Passengers came up to me that they were going to report this same woman flight attendant because she was very rude.", "num_found_useful": "12"}, {"ratings": "1.0", "reviewer_location": " NJ", "review_time_utc": "1388552400.0", "review_description": "Was away on vacation. The morning we were supposed to leave got cancelled for maintenance, I was told. They put me on a flight that evening and the remaining 4 people in my party on a flight the next day. When I called them, had my flight changed to the rest of the families and was told I would get vouchers for free travel within 72 hours... 96 hours passed, I called they said they changed my flight at no charge to remain with my family. I was getting no compensation, nor was the rest of the family. This cost an additional 250 for the night, both my husband and I a day at work and a lot of running around to find place for the evening, since my check out was quickly approaching, and booked for that night already. This is not the first time JETBLUE has not given us anything... I will NEVER fly them again - had it been something beyond their control (like weather), I would not be so angry, but I am sure it was a case of not flying because the flight was not totally booked... DO NOT TRUST THEM!!!!! To top it off, the flight we got,they put us in the most uncomfortable seats... the last row that they NEVER book - the seats that are against the bathroom wall that do not even recline.", "num_found_useful": "10"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1388552400.0", "review_description": "I am seven and a half months pregnant and I was flying from JFK to DR on Friday November 14… I called for days to see if I should upgrade my seat or to make sure I had an aisle seat. The lady on the phone told me to talk to them at the airport when I arrive. When I got there they told me I would have to pay and when I got to my seat there was literally no room... I called the flight attendant over and go “How do you put a seven and a half month pregnant woman like this…” I had the window seat and there was no room at all. Now on my flight home I had to fight for my aisle seat and when I had to use the bathroom I was told to sit down. Now landing was not for another 40 min. I am so disgusted how I was treated I will never in my life fly JetBlue ever again… Delta Air Lines never did this to me ever. I hope they don't do this to anyone else.", "num_found_useful": "9"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1388552400.0", "review_description": "The worst customer service. I arrived 55 minutes before departure. Traffic was very bad. They would not allow me to board. The agent was extremely rude. I was through security and at the gate and the plane sat for another 20 minutes but they would not allow me to board. I had to wait 4 hours for the next flight and they lost my luggage. 2 days now on vacation without clothes. Absolutely the worst customer service airline experience I have ever had. But more importantly just handled very poorly by the airline. I will avoid JetBlue in the future.", "num_found_useful": "10"}, {"ratings": "3.0", "reviewer_location": " CA", "review_time_utc": "1388552400.0", "review_description": "Flight from Long Beach to Orlando, with a stop in Austin. JetBlue sold this as 2 separate flights, rather than 1 flight with a stop over. Same airplane, same gate, same crew but a different seat number. I had to get off the plane in Austin, bags and all, and then I had to re-board for the second flight (leg). Same thing on the return flight from Orlando.", "num_found_useful": "5"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1388552400.0", "review_description": "I think my 4-year-old is well-traveled; this year alone he's been on 11 commercial flights. But this past summer, he was hesitant to board our flight from Fort Lauderdale to Copenhagen. I am scared, he said, the airplane is going to fall in the water. After some coaxing, we made it onboard. He was tense but we distracted him with his favorite games. Once airborne, the episode was quickly over, and the remaining 7 hours passed without incident. The next five flights were incident-free. And then there was Jetblue flight 875 on November 15 from Fort Lauderdale to Kingston.He was enthusiastic as we prepared, and with his cooperation we checked our bags, cleared security, and arrived at our gate with over an hour to spare. Priority access is accorded to children under 2, and our group was the last to be called for boarding. Then without warning, the old fear resurfaced. We made it as far as the door of the aircraft when we were met by the disapproving cabin crew who blocked our entry. Not while he is hysterical, we were told. I appealed to be allowed to stow our personal effects so I could calm him. \"We can't allow you onboard while he's hysterical.\" We were brushed aside and the door of the aircraft was shut in our faces, with our bags onboard.The aircraft won't wait. \"You can claim your bags in Jamaica. We'll try to accommodate you on a flight at 6 a.m. tomorrow. But only if he's quiet.\" To return at the crack of dawn for another Jetblue flight that might take us or not at their discretion; or receive a Jetblue flight credit for travel within the next two years (hopefully my child would have outgrown this fear by age 6)? One hour and a harried taxi ride to Miami International Airport later, we managed to purchase a new ticket out of pocket, cleared security, and were boarded on an American Airlines flight. Did he cry? Absolutely!The American Airlines solution was to assist me with depositing my personal belongings, seat us at the rear of the aircraft, and allow me the time and free hands to calm my child. Their risk assessment seemed to identify a screaming 4-year-old for what he is: a scared child, not a threat or inconvenience. After takeoff, he was back to being a normal child again. Then at the end of our hour-and-a-half journey, of his own accord, he visited the crew. \"Sorry for screaming, he said to one and all.\" The price of being reunited with my bags: $900. The price of getting Jetblue to refund the ticket they refused to honor: one year knocked off my life expectancy.It's a non-refundable ticket, the customer service agent explained, blatantly disregarding the fact that they refused to transport us although we had fulfilled our side of the contract. After a thirty-minute international call (who needs toll free numbers for their customer's convenience? Not Jetblue! ), common sense finally prevailed. A refund will be issued in 7-10 business days. Followed swiftly by a descent into the nonsensical again. The refusal to carry him was based on safety concerns. Because there is, of course, a precedence of a hysterical 4-year-old bringing down a commercial aircraft. But baggage being transported without accompanying passengers? Nope. No such precedence.Ever heard those final boarding calls warning late passengers that their baggage will be removed from the aircraft? I always thought there was a reason for that you know, the same reason why terminals are shut down when a bag is left unattended. It seems in Jetblue's thesaurus, comfort, convenience, and scheduling are synonyms for safety. To Jetblue's bemusement, I refuse to use their services to return home. Personally, I never thought it was a good idea to get back into the car with the abusive driver, because, you know, Fool me once and all that jazz. Here's a suggestion for Jetblue: save us all the inconvenience and embarrassment of being shunned at the cabin door by letting us know in advance that children are not allowed unless they behave like adults!", "num_found_useful": "18"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1388552400.0", "review_description": "My girlfriend and I purchased a brand new suitcase for the sole purpose of our vacation. After being picked up at Westchester County Airport and driving nearly 2 hours to our home. We noticed our brand new bag had many tears in it as if it had been dragged along the ground. Upon opening the suitcase we then noticed all of our items were soaking wet. This water damage ruined 200-300$ worth of gifts, and other items from our \"vacation\". After calling the airport to report this claim within the 4-hour window that's stated in the JetBlue Policy, we received no response and then proceeded to call the customer service line. When we spoke to a representative from JetBlue's Customer service line she had told me that the person who handles baggage claims at that airport was no longer available after 11pm. Being that our flight was delayed, because JetBlue was unable to located our flight's First Officer, our flight landed after 11pm. I was given an alternative phone number to contact someone at the airport which only gave me a recording saying no one was available. I left a message with my contact information and did not hear anything back. The representative I was on the phone with from JetBlue said the only option I had was to load my newly ruined items back into our newly ruined suitcase and drive it another 2 hours back to the airport and hope that there might be someone available to help me. When I asked the representative \"What if no one is available? Is this my only option\", her response was \"Yes sorry, hope your night gets better\".", "num_found_useful": "6"}, {"ratings": "1.0", "reviewer_location": " NJ", "review_time_utc": "1388552400.0", "review_description": "I'm extremely disappointed in my experience with JETBLUE. A month after I booked my flights the fare price dropped. Now I'm paying a premium ticket price for less desirable flights. I called JETBLUE customer service but they were unwilling to do anything to help me.", "num_found_useful": "3"}, {"ratings": "1.0", "reviewer_location": " CA", "review_time_utc": "1388552400.0", "review_description": "On Oct. 10, 2014 my husband and myself were due to fly out of Punta Cana D.R. at 1.00 pm on a full flight, to JFK and then fly onto SLC, arriving at 11:00 pm. We had never flown with Jetblue before but had heard good things. Realistically, we expected nothing. It's an airline, as long as it took off and landed we don't care.After waiting on the plane for 1 hour, everyone was bused back to the terminal where we had to wait for three hours. No one would tell us what was going or offer us meal credits. Finally, we boarded at 3:30 knowing there was no way we would make our connecting flight. The pilot then announced that there had been a problem with the toilets not flushing. Everyone was angry because we could have held it for the 3 1/2 hour flight. The pilot said that because it made a light flash in the cockpit, he refused to fly. Fine, whatever. We were told that everything would be sorted once we landed in JFK.By the time we arrived in JFK, 70% of the passengers had missed their connecting flight. We were immediately told by a JetBlue rep that there were no more flights tonight and that we would all be put in hotels. We all had to find our own way to terminal 5 (the JetBlue's terminal) where we were all told that we would not be put up in hotels. That all hotels were booked and that we could spend $150 of our own money (we would be reimbursed apparently) if we could find a hotel. There is no way at the last minute, at JFK you can find a hotel for $150. I spent over an hour trying. Plus there would be no compensation for $70 cab fair to said hotels. At this point my husband became angry and said they need to do something. The man serving us got very pissed and refused to help us. Refused to help anyone, he went off at us because apparently it's not his problem. Sorry buddy, you’re a Jetblue representative. It is your problem. Finally we spoke to a supervisor. She was no better, really and truly couldn't have care less. I asked her what we were all supposed to do. She shrugged and said, \"It's not my problem.\"We had to beg for meal credits. We begged! We hadn't eaten since the morning. All we got was $24 to cover dinner and breakfast for 2 people ... in an airport terminal. Yeah right!!! Most of the other passengers didn't even get meal credits. Because it was now 11:30 at night the terminal was closed. I had never seen anything like it before. Elderly couples, families with small children, honeymooners try to sleep on a freezing cold floor. One couple had gone on vacation before the wife was starting cancer treatment, talk about ruining a much need vacation.My husband called up JetBlue and the rep he spoke to was appalled at the way we were being treated and claimed this was not their policy. He then upgraded us to even more space seats and offered us more meal credits (only another $16 though) and put us on the next available flight. That flight left at 9.00 the next morning was a 6 hour flight to Long Beach, CA. There we would have to wait 4 hours for a connecting flight to SLC. At this point we just wanted to get home and were grateful for being upgraded so that we could at least try and sleep. No one else got any of this because they didn't call and complain.The airline attendant on our flight to Long Beach was the nicest JetBlue rep we came in contact. I was shacking and shivering while waiting for the bathroom (I do that when I only get an hour’s sleep) at which point he asked if I was ok. I explained everything that had happened and he gave us a free blanket (they normally cost $15 - it was a really crappy blanket) along with extra food.But our connecting flight to SLC was something else though. It was announced that the flight would be delayed 40 minutes because of fog in SLC. There was no fog in Salt Lake, we checked. When we finally boarded, the pilot said it was because of air force when flying from San Francisco. So wait, which was it? Fog on the flight from SLC or air force interference flying from San Francisco? The pilot also thought he was flying Delta and JetBlue. That was pretty funny.There was an elderly couple sat behind us who had been through all this and they hadn't been upgraded. The flight was empty and there were lots of 'even more space\" seats available. The elderly women asked if they could move and the flight attendant said, \"No, there was a charge for those seats.\" The old man muttered, \"This is ** ridiculous\" to which flight attendant name Kasey said, \"What did you just say to me?\" The gentlemen replied that he hadn't said anything to her. \"Yes you did, don't swear at me! I will have you escorted off this flight. Is that what you want?\" She then got the supervisor named Jerome who came and said, \"This is my flight and it's gonna go my way.\" I don't know what they teach their Jetblue representatives but they were so viscious and self centered, everything was an affront to their personal rights. I wouldn't want to be on one of the flights if there was a problem, they seemed like they would use the passengers as flotation devices. My husband stepped in at this point and told Jerome he needed to calm down and tried to explain what we had all gone through. He said, \"I don't care, I was delayed too.\" To which I responded, \"You weren't delayed 17 hours and made to sleep on terminal floor.\" He completely disregarded us and said, \"That didn't happen!\" Then walked off.I don't know how the gentlemen behind us did it but later in the flight he apologized to Kasey, she lapped it all up and said, \"If you had told me your situation nicely, I would have upgraded you.\" We were only halfway there, seats were still available, she didn't move them. All in all we were delayed 17 hours due to mechanical issues, we were treated like cattle (actually cattle are treated better) and all we got offered is $100 towards another JetBlue flight within the year.We have flown 27 times in the last 8 years with many different airlines and have never been treated this way. I can understand this treatment if it had been a weather delay, but this was a mechanical issue and a stupid one at that. I will never fly with Jetblue again. I will tell everyone and post this same review on every site on the internet. I don't know who Jetblue bribes to be classed as the best airline but it can go on forever.", "num_found_useful": "24"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1388552400.0", "review_description": "Checked in at JFK on 10/14/2014 for a flight to West Palm Beach airport. I approached the counter where 2 JetBlue associates were having a conversation. I was told to get back in the line until I am called. When they finally called \"next\" both associates refused to check me in because \"they don't know where I came from and may not have been on line\". I guess that they were upset that I walked up to the counter while they were having a conversation. I had to ask for a supervisor who then checked me in half-heartedly. I asked the supervisor if JetBlue's corporate office is still in Queens and she responded \"go to the website\". Terrible customer service at JFK airport.", "num_found_useful": "11"}, {"ratings": "1.0", "reviewer_location": " FL", "review_time_utc": "1388552400.0", "review_description": "I just love how JetBlue offers $50.00. That is the answer for them. I do not think I have ever been treated so bad by an airline or any company. I use to own my own business and I would have been out of business if I treated clients like they do. I went to my daughter's wedding. I flew JetBlue both ways. I transferred in Puerto Rico. On the trip down it was so easy. First off - my luggage which was brand new came out totally open. I am not even making a complaint on that issue. Many years ago, I had three neck surgeries when an eight wheeler truck rear ended my car. I am left with nerve damage and the lack of total use of my arm. I wear pain patches when it gets bad. On the flight when I arrived in Puerto Rico from St. Marten - the stewardess said that the passengers have to pick up the luggage. She failed to inform people that it was going to be a five block walk outside of one terminal to another and that if anyone has a problem this might be the time for wheelchair. I leave the plane and the elevator is LOCKED. I had to wait quite a while and worrying that the next flight is scheduled to leave and to find someone to open the elevator. I picked up the luggage. I had to wheel it over broken cement for about five blocks and into a big crowd. A JetBlue Employee tells me that I have to go to Agriculture and come back to her. Another lift of the luggage. Of course, the JetBlue employee was not there. So I had to cut into line. Then we had to go thru customs - which was a total mess. This all could have been prevented. First off -- an airlines of that size should have disability areas open and available - like the elevator. I get on the Flight to go to Ft. Lauderdale. I asked for a wheelchair when we arrive. I was in so much pain. This is the clincher - they have a wheelchair for me. I tipped the guy. He picks up my luggage and gets a call from JetBlue - so JetBlue dumped me on a bench and left me. JetBlue claims I should have made a 24 hour reservation for the wheelchair - so that gives them the right to dump me on a bench in FLL. Finally - an airplane employee comes up to me. She saw what happened. She informed me that I had another two block walk to get a cab. I - once again - had to drag luggage to the cab. I feel it is JetBlue's responsibility to have put me in a cab.I have been having medical massages and have been using patches. They offer me $50.00. I said - no that I wanted a flight to New York or that they pay for my expenses. I am now putting in a dispute with American Express. JetBlue writes back that you have to have 24 hour notice to get a wheelchair. After what they put me through - I do not deserve this. I do not like confrontation and just wanted to settle this. It is now a nightmare. They have said they tried to call me. Another lie. I offered my phone for them to check. There are no missed calls or voice mail messages. How would I ever trust that airlines flying me anywhere. I flew on JetBlue to St. Marten on August 10th from Ft. Lauderdale. I flew back on August 13th. Does anyone know where I can report them?? They also said they were going to call Puerto Rico. What is that going to do? That airport is a disaster. To treat a disabled person with such abuse - really upsets me.", "num_found_useful": "14"}, {"ratings": "1.0", "reviewer_location": " NY", "review_time_utc": "1388552400.0", "review_description": "Jet Blue changes our flight. My wife and I were to travel to Fla for a wedding. We were flying there and back same day. Jet Blue changed the flight time several times. The last time making it very difficult to attend the wedding. We had to cancel the flight. We were not only charged 40 percent of the airfare but the balance was held for a future trip. They can change the flight and charge us? As I see it we apparently cannot cancel the flight we can only change to another trip. If that is the case we in effect are not cancelling our ticket. I find it unacceptable and very poor business that they believe it's okay to both charge a forty percent cancellation fee and keep the balance forcing you to pay again to fly. This practice needs to be addressed and made public. I see no advantage in paying months in advance for a ticket and am sure many others will agree.", "num_found_useful": "15"}
]